{"user_id": "105767615911364381226", "name": "Joel Thompson", "time": 1551454013967, "rating": 1, "text": "After confirmed booking and charged deposit, reservation cancelled with offer of being put on waitlist...come again, Silver Lake?\n\nLook elsewhere for accommodations in Deer Valley would be my tip to you!", "pics": null, "resp": {"time": 1551468008335, "text": "Yes, we made a mistake by not changing settings on our website, which allowed for a booking to be made farther out than normal. The mistake was caught very shortly after the booking was made. Based on the owners use of the accommodation, we had no choice but to cancel the reservation. Had the reservation been for a different unit we would probably have granted it, even though the rates for next season were not yet set. We strive hard to provide a high level of service and this is not typical of how we treat future and/or past guests. We have made the necessary modifications to ensure that this will not happen again. My sincere apologies go out to Joel."}, "gmap_id": "0x875272d9b058dd7d:0x5ee3c2208a98570", "relevant": "Yes"}
{"user_id": "104486555542807109552", "name": "Scott Davidson", "time": 1447283391185, "rating": 5, "text": "Best ski area in North America.", "pics": null, "resp": null, "gmap_id": "0x875272d9b058dd7d:0x5ee3c2208a98570", "relevant": "Yes"}
{"user_id": "105790524983085066039", "name": "Robert DeLong", "time": 1425428968447, "rating": 5, "text": "Spectacular skiing and outstanding service!", "pics": null, "resp": null, "gmap_id": "0x875272d9b058dd7d:0x5ee3c2208a98570", "relevant": "Yes"}
{"user_id": "116010857130797361884", "name": "Ingrid and Matt Labronte", "time": 1475392417109, "rating": 5, "text": "Amazing views", "pics": null, "resp": null, "gmap_id": "0x875272d9b058dd7d:0x5ee3c2208a98570", "relevant": "Yes"}
{"user_id": "111182595077674366891", "name": "Liz W Poch", "time": 1627085008811, "rating": 5, "text": "Paige is the best! Everyone at this branch is super friendly and incredibly helpful! They always go the extra mile to make sure I have a great experience. I'm always so impressed with the staff when I stop by. Thank you!", "pics": null, "resp": null, "gmap_id": "0x87528767d0ec0e4d:0x7a2f1637a6fb6925", "relevant": "Yes"}
{"user_id": "117689170846448249054", "name": "Mario D'Ambrosio", "time": 1626437133578, "rating": 1, "text": "I have updated my systems on two titles for cars to be sent to the correct address and both were not updated by UfCU so now I get to waste my time because of their mistake. I would not recommend this group. Will not do business with them again.", "pics": null, "resp": null, "gmap_id": "0x87528767d0ec0e4d:0x7a2f1637a6fb6925", "relevant": "Yes"}
{"user_id": "115834685654999484011", "name": "Kathleen Hambly", "time": 1585165423975, "rating": 5, "text": "Simone is the best. She helped me to defer my car loan in these weird times. She was not only respectful but she was funny and the most helpful person that I have talked to all day. Thank you so much Simone. you are the best.", "pics": null, "resp": null, "gmap_id": "0x87528767d0ec0e4d:0x7a2f1637a6fb6925", "relevant": "Yes"}
{"user_id": "112679611213731715979", "name": "Crystal Olsen", "time": 1591629458998, "rating": 1, "text": "Ive called several times and there customer service is horrible! Train your staff to be more helpful and treat there customers with some respect and not like we are a problem when we call!", "pics": null, "resp": null, "gmap_id": "0x87528767d0ec0e4d:0x7a2f1637a6fb6925", "relevant": "Yes"}
{"user_id": "108599429350262421326", "name": "Sarah Jensen", "time": 1510264647735, "rating": 5, "text": "My fiance and I had an awesome stress-free experience with our first auto loan here. Paige is very kind and helpful!! She was very patient answering all our questions and helping us through the whole process. Highly recommend her and the whole team here. Really a great experience.", "pics": null, "resp": {"time": 1514404059776, "text": "Thank you for your kind review Sarah! Our staff love to hear about the positive ways they have helped our members. We will continue to work hard and provide the very best service for you at any of our University Federal Credit Union Locations.\n\nThank you!\n\n-David S.\nUniversity Federal Credit Union"}, "gmap_id": "0x87528767d0ec0e4d:0x7a2f1637a6fb6925", "relevant": "Yes"}
{"user_id": "105600432709432685702", "name": "Kevin Harkness", "time": 1586466721071, "rating": 1, "text": "***AVOID AT ALL COSTS*** I opened a HELOC with this institution as they advised me it was a NO FEE financial product. I never used the loan, and after many years I decided to close the account. Upon asking to close it, I was told I would not be charged a fee. Then, when I did close it, low and behold there is a $200 fee. They admitted they lied, but said too bad. This came straight out of the VP of Lendings mouth. They are liars. DO NOT DO BUSINESS WITH THEM.", "pics": null, "resp": null, "gmap_id": "0x87528767d0ec0e4d:0x7a2f1637a6fb6925", "relevant": "Yes"}
{"user_id": "107155459013670256338", "name": "Rachel Steed", "time": 1521500842073, "rating": 5, "text": "Friendly, comprehensive service. We were able to get debit cards in the branch, and the teller fixed our account so we wouldn’t be incorrectly charged a monthly fee. Highly recommend!", "pics": null, "resp": {"time": 1521563788345, "text": "Thank you for the wonderful review! We are glad to hear about the great service you received and look forward to future visits. Thank you for being a member!\n\n-David S.\nUniversity Credit Union"}, "gmap_id": "0x87528767d0ec0e4d:0x7a2f1637a6fb6925", "relevant": "Yes"}
{"user_id": "102120815205395833348", "name": "A.J. Backe", "time": 1477673547376, "rating": 5, "text": "I love University Credit Union!  This location is conveniently located on Highland Drive and rarely do I have to wait in line to make transactions.  The branch manager's priority is clearly to best help members, something you don't always find at other financial institutions.  Thank you for your professionalism UFCU!", "pics": null, "resp": {"time": 1518819070630, "text": "That is great to hear A.J.! We always appreciate kind words from our amazing members. Thank you!\n\n-David S.\nUniversity Federal Credit Union"}, "gmap_id": "0x87528767d0ec0e4d:0x7a2f1637a6fb6925", "relevant": "Yes"}
{"user_id": "107803579850968608641", "name": "Molly Aguayo", "time": 1476832631643, "rating": 5, "text": "I have been a member since '99 and I would never think of leaving. They treat me with respect and are always willing to help me make the right financial move. The rates are competitive. You can tell these people are here for me!", "pics": null, "resp": {"time": 1518819124132, "text": "That is great to hear! We really do appreciate having you as a member Amalie!\nThank you!\n\n-David S.\nUniversity Federal Credit Union"}, "gmap_id": "0x87528767d0ec0e4d:0x7a2f1637a6fb6925", "relevant": "Yes"}
{"user_id": "103832837924866432619", "name": "Bryce Wood", "time": 1548262636812, "rating": 1, "text": "Only been to this branch twice. I walked into the branch. four people are standing up from and I wait like 5 minutes to be helped and then the hole process of depositing my money took 25 mins. Ben was my cashier I counted my money in front of him and also told him the total amount. And he missed counted 50 dollars he deposited the total  wrong called me later and had to fix the error. Near the end of the deposit I requested a receipt then asked me if I would like a receipt. It takes only 5-10 mins at other branches. I am just so confused why I had a bad experience.  Felt I needed to share.", "pics": null, "resp": {"time": 1549043479068, "text": "Hello Bryce,\n\nWe are sorry to hear about your experience. We will forward on your concerns and do our best to make your experience an exceptional one moving forward. Thank you for being a member!\n\n-David S.\nUniversity Credit Union"}, "gmap_id": "0x87528767d0ec0e4d:0x7a2f1637a6fb6925", "relevant": "Yes"}
{"user_id": "104430934288835307535", "name": "Robin McClure", "time": 1492271819644, "rating": 1, "text": "If I could put this at zero I would- the Cottonwood manager was present at the Draper location when I had a loan officer that goes by \"M\" be disrespectful on the phone followed by leaving the phone off the hook and making rude comments. This team is unprofessional including the newer manager that aproved this treatment (New location manager at Cottonwood). I had very sweet memories with the prior manager. This bank may be local, but unfortunately has lost the local touch. I've been banking with this company for over 12yrs and will now be looking else where for my banking needs. Would not no longer recommend University Federal Credit Union - regardless of the location in the valley.", "pics": null, "resp": {"time": 1518818994379, "text": "Hello Robin!\nWe are sorry to hear about your experience and would like to learn more about how we could improve future visits. If you could please leave us additional information at our \"contact us\" page about the branch you visited we will do our best to make banking with University Federal Credit Union a great experience!\nhttps://www.ucreditu.com/contact/index.html\n\n- David S.\nUniversity Federal Credit Union"}, "gmap_id": "0x87528767d0ec0e4d:0x7a2f1637a6fb6925", "relevant": "Yes"}
{"user_id": "100307574635854993764", "name": "Haley Savage", "time": 1540833248558, "rating": 1, "text": "The worst banking/credit experience i’ve ever gone through. The most limited routes to paying your loan of any financial institution i’ve ever heard of. $10 over the phone $5 on their very own website BUT ITS FREE IF YOU SNAIL MAIL YOUR MONEY. Even if you’re locked out of your online account by their error they won’t wave the fees or take your money in any other way. Multiple times have falsely recorded financial agreements & when i went two separate times in the middle of the day to speak with someone to rectify the situation they left me in the waiting room for over an hour with ZERO communication that someone would be there to assist me in giving them their own money. The pudgey manager in the back office should cover his window if he’s going to eat multiple full size candy bars while ignoring eager customers wanting to again GIVE YOU MONEY. If you’re used to paying your bills on an app or handling billing issues in a few minutes over the phone this isn’t the place for you. No customer service on weekends or past 5 so forget trying to pay your bills on the weekend. You can set up autopay but you have to go in house to their 1 of 2 locations & fill out a paper. they’ll forget to file it as they have your financial arrangements in the past & they’ll make you drive all the way up to fill out the exact same paper. You can have the nicest staff in the world doesn’t cover up that y’all are stuck in the 90s.", "pics": null, "resp": {"time": 1542308074637, "text": "Hello Haley!\nWe are sorry to hear about your experience and would like to learn more about how we could improve future visits. If you could please leave us additional information at our \"contact us\" page about the branch you visited or contact our member service center at (801) 481-8800, we will do our best to make banking with University Federal Credit Union a great experience!\nhttps://www.ucreditu.com/contact/index.html\n\n- David S.\nUniversity Credit Union"}, "gmap_id": "0x87528767d0ec0e4d:0x7a2f1637a6fb6925", "relevant": "Yes"}
{"user_id": "110157131124351345716", "name": "Bree Ballard", "time": 1539788413331, "rating": 1, "text": "Beware of this credit union , They have excellent customer service , no one communicates with each other and they call you every few days if your late on payments even if you already made arragment. Im disapointed in the credit union as soon as were done with our loans we will be closing our account !", "pics": null, "resp": {"time": 1542308058239, "text": "Hello Bree!\nWe are sorry to hear about your experience and would like to learn more about how we could improve future visits. If you could please leave us additional information at our \"contact us\" page about the branch you visited or contact our member service center at (801) 481-8800, we will do our best to make banking with University Federal Credit Union a great experience!\nhttps://www.ucreditu.com/contact/index.html\n\n- David S.\nUniversity Credit Union"}, "gmap_id": "0x87528767d0ec0e4d:0x7a2f1637a6fb6925", "relevant": "Yes"}
{"user_id": "116427980967433332299", "name": "Amanda Tapp", "time": 1501002398116, "rating": 5, "text": "Extremely easy to work with auto loans, great rates and amazing customer service.   Kayla at the Holladay branch is very responsive and reliable.", "pics": null, "resp": {"time": 1514404364057, "text": "We are glad to hear you had such a wonderful experience Amanda! We look forward to serving you and any friends or family for years to come!\n\nThank you!\n\nDavid S.\nUniversity Federal Credit Union"}, "gmap_id": "0x87528767d0ec0e4d:0x7a2f1637a6fb6925", "relevant": "Yes"}
{"user_id": "101527084202252592655", "name": "Verl Tidwell", "time": 1518798171683, "rating": 5, "text": "Friendly staff, good Saturday hours, fast Loan service.", "pics": null, "resp": {"time": 1518818911192, "text": "Thank you for the amazing review! We are happy to hear you have great experiences with University Credit Union!\n\n-David S.\nUniversity Federal Credit Union"}, "gmap_id": "0x87528767d0ec0e4d:0x7a2f1637a6fb6925", "relevant": "Yes"}
{"user_id": "102244409799318054631", "name": "Howie Howard", "time": 1518719627484, "rating": 5, "text": "Jill is my go to gal...She's always takes good care of me and my family.", "pics": null, "resp": {"time": 1518818971554, "text": "Thanks Howie! We appreciate the positive feedback. Thank you for being a member with University Credit Union!\n\n-David S.\nUniversity Federal Credit Union"}, "gmap_id": "0x87528767d0ec0e4d:0x7a2f1637a6fb6925", "relevant": "Yes"}
{"user_id": "109580798430078811721", "name": "Rachelle Warren", "time": 1509379579000, "rating": 5, "text": "Great staff", "pics": null, "resp": {"time": 1514404148000, "text": "Thank you for the excellent review Rachelle! Our staff love to hear about the positive ways they have helped our members. We will continue to work hard and provide the very best service for you at any of our University Federal Credit Union Locations.\n\nThank you!\n\n-David S.\nUniversity Federal Credit Union"}, "gmap_id": "0x87528767d0ec0e4d:0x7a2f1637a6fb6925", "relevant": "No"}
{"user_id": "117771554794565101177", "name": "Amanda Kunkel", "time": 1473809547843, "rating": 5, "text": null, "pics": null, "resp": null, "gmap_id": "0x87528767d0ec0e4d:0x7a2f1637a6fb6925", "relevant": "No"}
{"user_id": "111019241471546991891", "name": "Trevor Poulson", "time": 1474291399833, "rating": 5, "text": null, "pics": null, "resp": null, "gmap_id": "0x87528767d0ec0e4d:0x7a2f1637a6fb6925", "relevant": "No"}
{"user_id": "105501898912847012913", "name": "Jared Walton", "time": 1508988591264, "rating": 5, "text": null, "pics": null, "resp": {"time": 1514404274253, "text": "We are glad that you had such an amazing experience at our Cottonwood Branch Jared! We look forward to providing that same level of service to you with each visit to our credit union.\n\nThank you!\n\n-David S.\nUniversity Federal Credit Union"}, "gmap_id": "0x87528767d0ec0e4d:0x7a2f1637a6fb6925", "relevant": "No"}
{"user_id": "113193813391034869679", "name": "Sherrie Patterick", "time": 1543342374454, "rating": 5, "text": null, "pics": null, "resp": {"time": 1549043501623, "text": "Thank you for the great review!\n\n-David S.\nUniversity Credit Union"}, "gmap_id": "0x87528767d0ec0e4d:0x7a2f1637a6fb6925", "relevant": "No"}
{"user_id": "111600178680690149648", "name": "Canniba11er", "time": 1521171743860, "rating": 5, "text": null, "pics": null, "resp": {"time": 1521216748177, "text": "Thank you! We are glad you had a great experience with University Federal Credit Union! We will do our best to continue to provide the quality customer service you have come to expect!\n\nDavid S.\nUniversity Credit Union"}, "gmap_id": "0x87528767d0ec0e4d:0x7a2f1637a6fb6925", "relevant": "No"}
{"user_id": "107239539625722229658", "name": "Jerad Peck", "time": 1620878494726, "rating": 5, "text": null, "pics": null, "resp": null, "gmap_id": "0x87528767d0ec0e4d:0x7a2f1637a6fb6925", "relevant": "No"}
{"user_id": "116802161947165542193", "name": "Osa Masina", "time": 1463694969252, "rating": 5, "text": null, "pics": null, "resp": null, "gmap_id": "0x87528767d0ec0e4d:0x7a2f1637a6fb6925", "relevant": "No"}
{"user_id": "108990504475329502701", "name": "Yunjun Jung", "time": 1583767468841, "rating": 5, "text": null, "pics": null, "resp": {"time": 1583854665211, "text": "Thank you for the great review!\n\n- David S.\nUniversity Federal Credit Union"}, "gmap_id": "0x87528767d0ec0e4d:0x7a2f1637a6fb6925", "relevant": "No"}
{"user_id": "113507794789697110737", "name": "Greg Bishop", "time": 1629488147270, "rating": 2, "text": "Clean place. Couldn't read two different cards and ended up leaving to gas elsewhere. Probably won't waste my time trying here next time. Next place had no problems so it wasn't the cards ...", "pics": null, "resp": null, "gmap_id": "0x87528bb7ab938cb3:0x5ee996e34cc50715", "relevant": "Yes"}
{"user_id": "102804404886905469549", "name": "Robert J", "time": 1604110049231, "rating": 3, "text": "3 stars because, the workers are nice and friendly so don't get me wrong by this review BUT there needs to be some order and better guidance on what the workers need to be doing. For instance they run out of coffee in the morning A LOT like its a common thing. I get your busy but with 6 or 7 people working at a time. It can be done with proper guidance and management. Lastly CLEAN, CLEAN, CLEAN. Not just during the down time but throughout the entire day. Ive come in to the store in the morning and its filthy, no social distancing either. During a pandemic... this need to be changed.", "pics": null, "resp": {"time": 1622742405973, "text": "Hi Robert, I'm sorry you had a bad experience at one of our stores! That's unacceptable. Those are good ideas thank you! I am glad the workers were friendly. We would really appreciate it if you gave us a call so we can get more details and make things right. 1-800-789-4455"}, "gmap_id": "0x87528bb7ab938cb3:0x5ee996e34cc50715", "relevant": "Yes"}
{"user_id": "100711480422225427121", "name": "William Warner", "time": 1599331062593, "rating": 2, "text": "Employees don't care if the restroom is out of soap. Dispenser was inoperable. Brought it to their attention. All I got for a response was how to get it to work after I told them I did everything. So in frustration I was about to buy some but they were out. Told them and they argued it was there. So then they said \"we around I guess\". So freaking gross.", "pics": null, "resp": {"time": 1622742897063, "text": "Hi William, I'm so sorry you had a bad experience at one of our stores! That's unacceptable. We would really appreciate it if you gave us a call so we can get more details and make things right. 1-800-789-4455"}, "gmap_id": "0x87528bb7ab938cb3:0x5ee996e34cc50715", "relevant": "Yes"}
{"user_id": "108990504475329502701", "name": "Yunjun Jung", "time": 1595733700428, "rating": 5, "text": "Brand new location, very clean!", "pics": null, "resp": {"time": 1622743033825, "text": "Thanks!👍👍"}, "gmap_id": "0x87528bb7ab938cb3:0x5ee996e34cc50715", "relevant": "Yes"}
{"user_id": "116144842995606883618", "name": "Dan Sessions", "time": 1592330734168, "rating": 5, "text": "Its open.", "pics": null, "resp": null, "gmap_id": "0x87528bb7ab938cb3:0x5ee996e34cc50715", "relevant": "No"}
{"user_id": "112087278878097401086", "name": "Katie Flores", "time": 1611503587245, "rating": 4, "text": "We have used Granite for several of our car loans and always had great service. Michelle Larsen recently helped my husband and I with another loan for a truck. She was professional and pleasant. Only giving 4 stars due to difficulty getting ahold of staff because of “Covid hours/working remote”.", "pics": null, "resp": null, "gmap_id": "0x8752886f10e79bb9:0x28c71adea02f3862", "relevant": "Yes"}
{"user_id": "108276524731453422860", "name": "DTL 111", "time": 1614183398213, "rating": 2, "text": "I've been a Granite Credit Union customer my entire life.  Service has gone way downhill, and the phone service is downright awful!  You have to wait 10 minutes, listen to annoying music and an obnoxious guy every 15 seconds telling you how sorry he is they can't take your call, and then finally put your number in for a callback.  Up your game GCU or I'm gone!", "pics": null, "resp": {"time": 1614186755594, "text": "Thanks for sharing your feedback. We have experienced a significant increase in call volume over the last year and we know the call time has been rough. We’re working hard to correct that. Thanks for your membership and for sharing your concerns."}, "gmap_id": "0x8752886f10e79bb9:0x28c71adea02f3862", "relevant": "Yes"}
{"user_id": "100560199473391024980", "name": "Darla Shirley", "time": 1565049112675, "rating": 5, "text": "I’ve been banking with Granite since ‘83 & still did when I moved to Boise for ten years! Moved back & happy they’re so close to me now, at Quarry Bend! And, they are always helpful & friendly!", "pics": null, "resp": null, "gmap_id": "0x8752886f10e79bb9:0x28c71adea02f3862", "relevant": "Yes"}
{"user_id": "102018046750504980072", "name": "Sam “Bsiz90” Poto", "time": 1507051724830, "rating": 5, "text": "The overall company and staff of each branch are great.  This branch is open till 7, which is nice.  Since i work till 6.", "pics": null, "resp": null, "gmap_id": "0x8752886f10e79bb9:0x28c71adea02f3862", "relevant": "Yes"}
{"user_id": "107480276998874071445", "name": "Chandler Morris", "time": 1578340244992, "rating": 5, "text": "Amber was very kind and helpful.", "pics": null, "resp": {"time": 1578344462908, "text": "Thank you for your review!"}, "gmap_id": "0x8752886f10e79bb9:0x28c71adea02f3862", "relevant": "Yes"}
{"user_id": "100985036005704083212", "name": "Junetta Ortega-Barton-Jolley", "time": 1506088835346, "rating": 5, "text": "Love banking with GCU excellent staff great customer service.😋", "pics": null, "resp": null, "gmap_id": "0x8752886f10e79bb9:0x28c71adea02f3862", "relevant": "Yes"}
{"user_id": "108990504475329502701", "name": "Yunjun Jung", "time": 1610217943892, "rating": 5, "text": "Ultimately kind staffs!!", "pics": null, "resp": null, "gmap_id": "0x8752886f10e79bb9:0x28c71adea02f3862", "relevant": "Yes"}
{"user_id": "110273970575622540459", "name": "Tyler Bolen", "time": 1513403703854, "rating": 3, "text": "Sometimes long wait time, fee to use credit card for payment, not much online services requiring you to call or go in", "pics": null, "resp": null, "gmap_id": "0x8752886f10e79bb9:0x28c71adea02f3862", "relevant": "Yes"}
{"user_id": "116602504730924936357", "name": "Not Known", "time": 1625156912049, "rating": 1, "text": "Predatory cancellation practices override all positive aspects of HotWorx.  When signing up in October I asked about cancelation policy and was told by representative Ashley 30-day notice in person was required to cancel.  I came in to cancel in May, a few days after being charged the monthly fee, and was told I would be charged 2 more times to cancel or could pay 2 monthly fees right then.  I did rely on the verbal communication when signing up.\nThe workouts are good; the place is clean, and staff is pleasant.  Booking time slots is easy but needs to be preplanned as most convenient times get taken fast.  The company’s matts are mandatory and pricey.", "pics": null, "resp": {"time": 1625258671101, "text": "HOTWORX nationwide asks for 60 days cancellation notice. Its no secret, this is written right in the 5 month contract that you signed. The word predatory really doesnt fit since it is written and all employees are trained to go over this as a part of signing up! Feel free to reach out if you would like another copy of your agreement that you signed. Management would've been happy to assist you had you asked. Glad you enjoyed the workouts!"}, "gmap_id": "0x87528b34a4f8738f:0x79d61042dfa75e8", "relevant": "Yes"}
{"user_id": "104914416616188066324", "name": "Ben Buehler", "time": 1604546353368, "rating": 5, "text": "1.  The Staff is awesome!  2.  I needed to be able to work out without pain.  I’ve tried hot yoga with others, it’s muggy, people looking at you, etc.   HOTWORX is amazing.  Hot but dry.  Many different workouts.  You feel great after.  And it’s covid friendly.  It’s exactly what I needed and was looking for!", "pics": null, "resp": null, "gmap_id": "0x87528b34a4f8738f:0x79d61042dfa75e8", "relevant": "Yes"}
{"user_id": "111960560478092973242", "name": "Elsie Huefner", "time": 1609204691046, "rating": 5, "text": "This place is the best. Excellent self care and healthy way to gain muscle. I’m a therapist and recommend clients who suffer from anxiety to implement hotworx into their lifestyle. All who have done so report remarkable improvement! Me included!", "pics": null, "resp": null, "gmap_id": "0x87528b34a4f8738f:0x79d61042dfa75e8", "relevant": "Yes"}
{"user_id": "115022888915240355408", "name": "Meg Wilson", "time": 1630285218169, "rating": 5, "text": "Love this place, your result become your motivation.", "pics": null, "resp": null, "gmap_id": "0x87528b34a4f8738f:0x79d61042dfa75e8", "relevant": "Yes"}
{"user_id": "108989914454926508326", "name": "Lisa Kireiev", "time": 1614962448388, "rating": 5, "text": "I am ADDICTED!!!!! The best workout I have ever come across. Thank you to the awesome staff for making me feel so welcome!!!!", "pics": null, "resp": {"time": 1614973635021, "text": "So glad you are loving it! I cant wait to hear how its going down the road too!"}, "gmap_id": "0x87528b34a4f8738f:0x79d61042dfa75e8", "relevant": "Yes"}
{"user_id": "112134449533313848080", "name": "Jessie Chelsea", "time": 1601608841152, "rating": 5, "text": "I love this place! My osteoarthritis doesn’t bother me nearly as much and I’m strengthening the muscle to help! Plus losing weight sweating in these saunas. It’s great! Variety of exercises and programs! I’m in heaven! You can’t beat this! I can’t stop talking about this place! Thank you Hotworx!", "pics": null, "resp": null, "gmap_id": "0x87528b34a4f8738f:0x79d61042dfa75e8", "relevant": "Yes"}
{"user_id": "109372738394671990534", "name": "Emily Austin", "time": 1601934481007, "rating": 5, "text": "I have loved this place; being able to go in whenever I’m available has been amazing and has helped me be motivated to work out. The sauna heat also makes me feel like I’m getting that much better of a workout. It also feels safe working out in a space with just myself!", "pics": null, "resp": null, "gmap_id": "0x87528b34a4f8738f:0x79d61042dfa75e8", "relevant": "Yes"}
{"user_id": "106178229675522949544", "name": "Tonya Sanchez", "time": 1595441862221, "rating": 5, "text": "I love this place! I look forward to my workout and go ALL the time. I recommend this place to everyone I know! I own a Salon & Spa and there’s lots of people going in and out of my place and they all know about HOTWORX! The staff, incredible!!! They are always helpful, fun and very personable, I feel like they remembered me early on and they also make it fun to go! If you haven’t been to Hotworx you need to go!", "pics": null, "resp": {"time": 1595446342636, "text": "Awe, thanks Tonya! We're happy to see both you and your husband enjoying the studio!"}, "gmap_id": "0x87528b34a4f8738f:0x79d61042dfa75e8", "relevant": "Yes"}
{"user_id": "109174668258327772186", "name": "Stephanie", "time": 1600393163395, "rating": 5, "text": "This is an amazing place to workout! I love the variety of classes. Already seeing results in a short time! The staff is so friendly! I highly recommend!", "pics": null, "resp": {"time": 1600443105612, "text": "Love it!"}, "gmap_id": "0x87528b34a4f8738f:0x79d61042dfa75e8", "relevant": "Yes"}
{"user_id": "113514272465932288440", "name": "Ashley Mortensen", "time": 1590600829108, "rating": 5, "text": "I LOVE this place. I can be dripping in sweat, be in and out in 15 minutes (or longer if you want to take more classes), and the recovery time on my muscles is sooo much better. The staff is awesome and always willing to help out. It is SO SO worth it. The first week, I lost 6 pounds!! You cant ask for more than that!\n\nThey have a wide range of classes so you never get bored, and you can do it whenever it fits into your schedule. No longer do you have to wake up at 6 am or wait all day to take your favorite fitness class. I cannot rave more about this place!!", "pics": null, "resp": null, "gmap_id": "0x87528b34a4f8738f:0x79d61042dfa75e8", "relevant": "Yes"}
{"user_id": "107277818193090367437", "name": "Tangikina Katoa", "time": 1601515082454, "rating": 5, "text": "I Love this place especially with this pandemic, it’s clean, private, socially distant, and you get the best workout in a shorter amount of time. Staff is super friendly and helpful especially Kasi! Highly recommend this place especially if you love saunas", "pics": null, "resp": null, "gmap_id": "0x87528b34a4f8738f:0x79d61042dfa75e8", "relevant": "Yes"}
{"user_id": "110642220591716352080", "name": "Amber Ford", "time": 1596581507447, "rating": 5, "text": "I had an awesome first experience. The facility was super clean and the staff was extremely helpful! April was very knowledgeable about the benefits the gym has to offer. There are a wide range of workouts and it’s very private and comfortable!", "pics": null, "resp": null, "gmap_id": "0x87528b34a4f8738f:0x79d61042dfa75e8", "relevant": "Yes"}
{"user_id": "114368497169314783114", "name": "Monica Hernandez", "time": 1603753981054, "rating": 4, "text": "I love working out at hot worx. It is a different way of working out but it is the best place. It is open 24/7, which is so good.", "pics": null, "resp": null, "gmap_id": "0x87528b34a4f8738f:0x79d61042dfa75e8", "relevant": "Yes"}
{"user_id": "109162499295305712610", "name": "Angel Duran", "time": 1602000052544, "rating": 5, "text": "I tried the free class and took 1 month to decide to sign up. But the whole month I knew I wanted to go back. Im happy I finally signed up I feel like this is the work out place for me and I've tried a couple other things like crossfit etc. These workouts are great and I love the time frame.", "pics": null, "resp": null, "gmap_id": "0x87528b34a4f8738f:0x79d61042dfa75e8", "relevant": "Yes"}
{"user_id": "111084580990947925756", "name": "FATAI TUIONO", "time": 1601486291396, "rating": 5, "text": "This place is the best workout gym EVER!! Love love love working out here!! Clean, private and the staff are super friendly and very welcoming!!", "pics": null, "resp": null, "gmap_id": "0x87528b34a4f8738f:0x79d61042dfa75e8", "relevant": "Yes"}
{"user_id": "106519038923217441455", "name": "Mckali Higginson", "time": 1590626638417, "rating": 5, "text": "I think this place is brilliant, hot work outs are the best and make you feel so amazing after! I love the privacy and that you can go on your own time to the class of your choice. Definitely recommend!", "pics": null, "resp": null, "gmap_id": "0x87528b34a4f8738f:0x79d61042dfa75e8", "relevant": "Yes"}
{"user_id": "110458113417204348770", "name": "Lupe Fifita", "time": 1602793580432, "rating": 5, "text": "I had to cancel my Vasa membership!!! I only went there for their saunas, but they never opened it ever since covid hit and when I heard about this place I was hooked. The infrared sauna here at HOTWORX is giving me life again after having 8 kids.\n\nI also had rosacea on my cheeks after my last pregnancy and I couldn’t get rid of it but the infrared sauna cleared it up in just a couple days.\n\nI absolutely love this place. It’s my home away from home.", "pics": null, "resp": null, "gmap_id": "0x87528b34a4f8738f:0x79d61042dfa75e8", "relevant": "Yes"}
{"user_id": "113774915136537099462", "name": "SndS.plus7 Tuamoheloa", "time": 1601489767015, "rating": 5, "text": "Love, Love, Love it @ HOtWORX who ever came up with this is amazing!!!! Thank u!!!  I’m basically there twice a day🤣 After having 7 kids looking for somewhere to workout, meditate, sweat, mommy time, girl time and alone time all at once!! This is the place to come!!! 😍I’ve recommended this place to all my hot mamas and now we all join and giving ourselves a treat doing what we love to do away from home at our own pace.... Kasi she’s been the best and very helpful through everything with adding ppl on and giving them the warm welcoming to all the new members. Love her service and she so friendly, I think I just made a new friend at HOTWORX..lol thanks girl, keep up the awesome work! This would be 10star rate and the facility is soooo clean!!!", "pics": null, "resp": null, "gmap_id": "0x87528b34a4f8738f:0x79d61042dfa75e8", "relevant": "Yes"}
{"user_id": "102647510990106601657", "name": "viliami fonua", "time": 1601587999713, "rating": 5, "text": "I’m so excited about this place!! Love working out and getting that extra burn is a plus!!! Clean and  safe environment!!", "pics": null, "resp": null, "gmap_id": "0x87528b34a4f8738f:0x79d61042dfa75e8", "relevant": "Yes"}
{"user_id": "117362813142598903713", "name": "Rilee Nilsson", "time": 1594782000176, "rating": 1, "text": "I was super excited when i heard this place was opening up. I went in and got all set up with the hopes of them opening in February the date kept getting pushed then COVID happened. Unfortunately I was moving out of state for the summer and left in May. I never went in and got fully set up or anything so I just didn’t think any thing of it and figured I could get started when i moved back in November. You can imagine my shock when i saw three months worth $130+ taken out of my bank account since May. I called to see what was up and was told sorry there’s nothing we can do and that they just started billing people once it opened up regardless if they had been in or not. I’m just upset that they couldn’t refund me anything seemings how I never saw the place even finished or did one work out there.", "pics": null, "resp": {"time": 1594845379914, "text": "Hi Rilee. I hope you got our email with the contract that you signed when you enrolled to clear up any misunderstandings. We did wave your 60 day notice with the understanding you're no longer in the state which is normally a $99 charge. Please reach out if you have any further questions."}, "gmap_id": "0x87528b34a4f8738f:0x79d61042dfa75e8", "relevant": "Yes"}
{"user_id": "111713943701179090278", "name": "Megan Wilson", "time": 1590713429389, "rating": 5, "text": "I love HOTWORX Sugarhouse, the staff is accomidating and very informative.  They have great prices and the results are amazing!  My mental focus gas increased and I have more energy.", "pics": null, "resp": null, "gmap_id": "0x87528b34a4f8738f:0x79d61042dfa75e8", "relevant": "Yes"}
{"user_id": "106873273007086153483", "name": "Karisa Crandall", "time": 1590600232842, "rating": 5, "text": "Fun and relaxing environment great way to stretch out and meditate or get pumped and push your self also privacy while doing so. Kas was great", "pics": null, "resp": null, "gmap_id": "0x87528b34a4f8738f:0x79d61042dfa75e8", "relevant": "Yes"}
{"user_id": "104877017752804546458", "name": "Althea Sam", "time": 1594851356189, "rating": 5, "text": "I love the clean environment, the ladies are all so friendly and the hot worx with all the different workouts is awesome! ❤️", "pics": null, "resp": {"time": 1594919664689, "text": "We love seeing your smiley face every week!"}, "gmap_id": "0x87528b34a4f8738f:0x79d61042dfa75e8", "relevant": "Yes"}
{"user_id": "101683919557400338793", "name": "Christopher Barnes Williams", "time": 1590602894837, "rating": 5, "text": "This place has been a life-saver especially coming out of quarentine. They have 24 hr access which is convenient, and everything is very well kept and very clean. Kasi and the staff are super awesome to work with, even the owner is very friendly and down to earth.\nI like that the gym spaces are are big enough for you and a friend or two, but its still very private which let's you really focus. On top of that, there are many benifits to working in their infared saunas; you sweat more in less time really maximizing your results, but it does make you feel fresher when you are done.\nEach workout is directed by a virtual guide which makes it very easy to follow along and very ever workout they show forms for: beginner, intermediate, and expert level participants.\nI signed up immediately and have been going 3 or 4 times a week. Their app lets you know whats available and the rest you do yourself.\nI also signed my mom and sister up and they have really loved it.", "pics": null, "resp": null, "gmap_id": "0x87528b34a4f8738f:0x79d61042dfa75e8", "relevant": "Yes"}
{"user_id": "111303151978525607143", "name": "Mirna Hekking", "time": 1603145918123, "rating": 5, "text": "I really enjoy coming here and detox my body", "pics": null, "resp": null, "gmap_id": "0x87528b34a4f8738f:0x79d61042dfa75e8", "relevant": "Yes"}
{"user_id": "106096973741555655835", "name": "Christopher Shane", "time": 1611640381213, "rating": 5, "text": "Love it!", "pics": null, "resp": {"time": 1614973598884, "text": "Thanks Chris!"}, "gmap_id": "0x87528b34a4f8738f:0x79d61042dfa75e8", "relevant": "Yes"}
{"user_id": "110319556194702885133", "name": "Hill Dwyer", "time": 1624150724046, "rating": 5, "text": null, "pics": null, "resp": null, "gmap_id": "0x87528b34a4f8738f:0x79d61042dfa75e8", "relevant": "No"}
{"user_id": "110754522903342541424", "name": "Alehi Miller", "time": 1591932416999, "rating": 5, "text": null, "pics": null, "resp": null, "gmap_id": "0x87528b34a4f8738f:0x79d61042dfa75e8", "relevant": "No"}
{"user_id": "113560533419218703720", "name": "Mc Family", "time": 1614273754022, "rating": 5, "text": "I owe the success of my business to the kind and helpful folks at Ensign.  They all know me by name and always take the time to make sure I get what I need. Mary knows I am budget conscious and talks me through pricing.  Mark,  Krystle, Anna, Tara, Cassandra and Rachel are design pros and so patient with all my questions. Melissa knows the orders inside out.  Kathy always greets me happily.  Doug is just plain cool as are all the prep peeps and staff that work behind the scenes. Thanks,  Ensign.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPB91RHHAyuSbsvxV_QSuggHSb2RqyPASaWULdl=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOf3-fxrP1I-FpIT_rZmTLVbH072xR7HqZxPCHn=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMt_94WaMq85as-op1iAW9wXEwfEk2Dj3eFfZLi=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN_M6-DzjTIzlLBp0fXH3mE5RLOu5ssUDM4wcmA=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8752f569a04d64bf:0x2b7e577cda98e81a", "relevant": "Yes"}
{"user_id": "110611984133018229031", "name": "Rachelle Roberts", "time": 1620398754491, "rating": 5, "text": "Love the service and selection here! My favorite wholesaler for flowers. The staff is friendly and helpful.", "pics": null, "resp": null, "gmap_id": "0x8752f569a04d64bf:0x2b7e577cda98e81a", "relevant": "Yes"}
{"user_id": "115752681716756828392", "name": "John Tuberosa", "time": 1629160047313, "rating": 5, "text": "Bringing beauty to life...LOVE IT...", "pics": null, "resp": null, "gmap_id": "0x8752f569a04d64bf:0x2b7e577cda98e81a", "relevant": "Yes"}
{"user_id": "108989914454926508326", "name": "Lisa Kireiev", "time": 1615316503263, "rating": 5, "text": "We love Ensign!!!! Thank you for the friendly and kind customer service!!!", "pics": null, "resp": null, "gmap_id": "0x8752f569a04d64bf:0x2b7e577cda98e81a", "relevant": "Yes"}
{"user_id": "116611970034692348699", "name": "Sandy Mataele", "time": 1590601368423, "rating": 5, "text": "I had such a great experience! Wonderful variety and really nice and helpful staff.", "pics": null, "resp": null, "gmap_id": "0x8752f569a04d64bf:0x2b7e577cda98e81a", "relevant": "Yes"}
{"user_id": "103934381849375378352", "name": "Chris Sanchez", "time": 1555624087741, "rating": 5, "text": "I absolutely adore the entire team at Ensign, they have worked side by side with our company to help us grow. I have worked with many different wholesale floral companies and have never had the personalized care that I have received here. Highly recommend!", "pics": null, "resp": null, "gmap_id": "0x8752f569a04d64bf:0x2b7e577cda98e81a", "relevant": "Yes"}
{"user_id": "114213202970245253712", "name": "Benjamin Romney", "time": 1542235737732, "rating": 5, "text": "This is an excellent wholesale house, whether you are able to visit in person, or deal with the well trained staff of salespeople on the phone.  I have bought from Ensign for many years, and always count on their quality and selection.  It's a great place for Salt Lake designers, and for those in outlying areas who are along the delivery routes.", "pics": null, "resp": {"time": 1542305686492, "text": "Thanks for your review Benjamin! I am so happy to hear that your experiences with Ensign have been top notch! Thanks for you business!"}, "gmap_id": "0x8752f569a04d64bf:0x2b7e577cda98e81a", "relevant": "Yes"}
{"user_id": "108509623777068811685", "name": "Hea Le", "time": 1554931684656, "rating": 1, "text": "Terrible drivers. I haven't bought anything from Ensign, but I certainly wouldn't based on the driving performance of it's workers. I was traveling southbound on I-15 on a raining day, and an Ensign van was tailgating me. The road was not very crowded and there were three lanes around the Willard area. After tailgating me for a couple miles, the driver passed me on the right side, even though the left lane was open and merging traffic was entering the right. This made the driver cut me off. What a way to represent your company.", "pics": null, "resp": null, "gmap_id": "0x8752f569a04d64bf:0x2b7e577cda98e81a", "relevant": "No"}
{"user_id": "115752681716756828392", "name": "John Tuberosa", "time": 1629160047313, "rating": 5, "text": "Bringing beauty to life...LOVE IT...", "pics": null, "resp": null, "gmap_id": "0x8752f569a04d64bf:0x2b7e577cda98e81a", "relevant": "Yes"}
{"user_id": "110074784002762951117", "name": "Brittney Lee", "time": 1541692624149, "rating": 4, "text": "Best selection we could find in Utah but nothing compares to California's flower marts. Doug was very helpful!", "pics": null, "resp": {"time": 1541698898409, "text": "Thanks Brittney. Yes, the flower marts in CA are wonderful. They do have the benefit of having many of the growers just down the street, Ha Ha! Thank you for your business! I am glad Doug was able to take care of you."}, "gmap_id": "0x8752f569a04d64bf:0x2b7e577cda98e81a", "relevant": "Yes"}
{"user_id": "116611970034692348699", "name": "Sandy Mataele", "time": 1590601368423, "rating": 5, "text": "I had such a great experience! Wonderful variety and really nice and helpful staff.", "pics": null, "resp": null, "gmap_id": "0x8752f569a04d64bf:0x2b7e577cda98e81a", "relevant": "Yes"}
{"user_id": "114034604415363204024", "name": "Àl Smith", "time": 1588702690514, "rating": 4, "text": "Customer service and product is much improved , therefore i have removed my poor review and would now recommend this company", "pics": null, "resp": null, "gmap_id": "0x8752f569a04d64bf:0x2b7e577cda98e81a", "relevant": "Yes"}
{"user_id": "103760037160510578332", "name": "K Mack", "time": 1452534648950, "rating": 5, "text": "Love all the staff I deal with there, we order maybe bi-weekly for our hotel and they are always GREAT to work with, great selection and great staff!", "pics": null, "resp": null, "gmap_id": "0x8752f569a04d64bf:0x2b7e577cda98e81a", "relevant": "Yes"}
{"user_id": "112307153531120103536", "name": "Cary Hanks", "time": 1517861822704, "rating": 5, "text": "Thanks for always going the extra mile to help! Melissa is awesome!", "pics": null, "resp": null, "gmap_id": "0x8752f569a04d64bf:0x2b7e577cda98e81a", "relevant": "Yes"}
{"user_id": "116406318383813302516", "name": "Juliana Broadbent", "time": 1480457642811, "rating": 5, "text": "Great flowers and Great staff!", "pics": null, "resp": null, "gmap_id": "0x8752f569a04d64bf:0x2b7e577cda98e81a", "relevant": "Yes"}
{"user_id": "115407199121438991127", "name": "Sabri Keleş", "time": 1482339557128, "rating": 5, "text": "Ensign Wholesale Floral", "pics": null, "resp": null, "gmap_id": "0x8752f569a04d64bf:0x2b7e577cda98e81a", "relevant": "No"}
{"user_id": "100518858506638839555", "name": "Lisa Reed", "time": 1472671353948, "rating": 1, "text": null, "pics": null, "resp": null, "gmap_id": "0x8752f569a04d64bf:0x2b7e577cda98e81a", "relevant": "No"}
{"user_id": "108038153550841712245", "name": "Mandy Woodard", "time": 1548894182363, "rating": 5, "text": null, "pics": null, "resp": null, "gmap_id": "0x8752f569a04d64bf:0x2b7e577cda98e81a", "relevant": "No"}
{"user_id": "101219016455497415888", "name": "Tanya Newsom", "time": 1462979508797, "rating": 5, "text": null, "pics": null, "resp": null, "gmap_id": "0x8752f569a04d64bf:0x2b7e577cda98e81a", "relevant": "No"}
{"user_id": "112483138234367099739", "name": "kruthi nagaraja", "time": 1598041600124, "rating": 5, "text": null, "pics": null, "resp": null, "gmap_id": "0x8752f569a04d64bf:0x2b7e577cda98e81a", "relevant": "No"}
{"user_id": "109462364457401422451", "name": "Christy Atkinson", "time": 1471319276698, "rating": 5, "text": null, "pics": null, "resp": null, "gmap_id": "0x8752f569a04d64bf:0x2b7e577cda98e81a", "relevant": "No"}
{"user_id": "106094490648657787868", "name": "Jesus Rivra", "time": 1601252308670, "rating": 4, "text": null, "pics": null, "resp": null, "gmap_id": "0x8752f569a04d64bf:0x2b7e577cda98e81a", "relevant": "No"}
{"user_id": "106162355370602927448", "name": "Krystle Connaughton", "time": 1552498602866, "rating": 5, "text": null, "pics": null, "resp": null, "gmap_id": "0x8752f569a04d64bf:0x2b7e577cda98e81a", "relevant": "No"}
{"user_id": "118213205822210773983", "name": "Kimberly Colins", "time": 1447808804144, "rating": 1, "text": "There are 2 reasons why I gave this salon a 1 star rating:\n1st reason is the outrageous amount of money they charge for their services. I understand that they are trying to be an \"upscale\" salon, so they want to charge \"upscale\" prices, however the service isn't \"upscale\". Its like buying a dress from Kohl's for the price of Armani. You might have a nice dress but its not worth $500, more like $30.\n2nd reason is how disingenuous the staff/owners are. They are here to sell, sell, sell you anything and everything whether you need it or not. It really does get annoying and frustrating. I did my hair there for about 6 months and haven't rescheduled after the last time when my hair didn't look the \"$300+\" bill I paid for it. There are so many hair stylists that will do a great job for a fair price ($150 instead of $300+) and won't treat you like a \"money bag\". Don't go there.", "pics": null, "resp": null, "gmap_id": "0x8752f502285f27fb:0xe96851b51c9ffba9", "relevant": "No"}
{"user_id": "114250210743370177837", "name": "Taylor Brown", "time": 1246743652181, "rating": 1, "text": "I went to Estilos based on the reviews.... the girl that has been waxing my eyebrows for years moved. The salon is cute and fun, however I felt a little ignored.. 10-15 minutes later she was done, I looked up and thought ok... they look decent.... I went to pay and was a little surprised at my 75$ total then was completely caught off guard when the girl asked \"how much of a tip would you like to add to your card\" Yes, I was going to tip, however I would prefer to add it on the paper myself, not to be pressured into announcing it to the salon. I went home and washed my face to notice my \"new brows\" were more pencil then they were my actual brows. Let's hope they grow back quickly...", "pics": null, "resp": null, "gmap_id": "0x8752f502285f27fb:0xe96851b51c9ffba9", "relevant": "No"}
{"user_id": "104322153914312543484", "name": "Charity Lund", "time": 1325653842164, "rating": 1, "text": "I used to shop here for the Marlies Dekkers bras, which I love, but this boutique has the worst customer service. They post their hours but then change them when it's convenient and never seem to be open. They treat their customers like an inconvenience and make it as difficult as possible to buy anything from them. I tried to give them the benefit of the doubt but my last visit was the last straw. The owner, Rena, continued to give me the wrong sizes even though I made it clear several times which size would fit me best and then she dismissed me for taking too long. I made a rushed decision and when I came back to make an exchange due to buyer's remorse the door was locked and there were no business hours posted for that day (it was the middle of the day on a Saturday). The next time I tried to make the exchange the sales woman said I had to come back when the owner was there to make any exchanges. The next attempt I called first to make sure the owner would be there and Rena answered the phone. She actually lied to me and said Rena wouldn't be in until 2 that day. The woman is wack and the way she runs the place baffles me. The next time I buy a Marlies Dekkers bra I will just add it to my travel expenses because it certainly won't be from this place ever again.\nBy the way, for all the fake reviews, it's pretty obvious that a post is bias to the owner when there is no specific experience in the writing. No one cares about a “great staff” -they want to know what the staff does to be considered so great. When a business has this many bad reviews, the plan should be to fix the problems, not the reviews.", "pics": null, "resp": null, "gmap_id": "0x8752f502285f27fb:0xe96851b51c9ffba9", "relevant": "Yes"}
{"user_id": "108989914454926508326", "name": "Lisa Kireiev", "time": 1499992020613, "rating": 5, "text": null, "pics": null, "resp": null, "gmap_id": "0x8752f502285f27fb:0xe96851b51c9ffba9", "relevant": "No"}
{"user_id": "105656335580740526923", "name": "Traysha Kent", "time": 1630258477665, "rating": 5, "text": "The Boujee bar has a beautiful, outgoing and encouraging  confidence energy.  I came in for a wash and blowout. The girls were so kind and threw in a deep condition treatment because of a 5 minute wait. I loved my experience so much I later came in for a French tip pedicure. The pedicure was so luxurious and nourishing. The French tip was done beautifully . I will choose the Boujee bar again for future salon services.", "pics": null, "resp": null, "gmap_id": "0x875287dced2a1f1f:0xf3764a9211d4f382", "relevant": "Yes"}
{"user_id": "118231720842601456482", "name": "Danielle Latu", "time": 1629490139532, "rating": 5, "text": "Okay first, the entire salon is beautiful. The decor and the layout was so aesthetically pleasing. Second, I got my hair dyed dark a few months ago from a different salon and I wasn't a fan of the color. I wanted to go back toy normally color and Nyna made my hair perfect. Even better than what it normally was haha she holds a conversation so well and is so knowledgeable about every part of the hair structure. She is hands down my go to, from here on out.", "pics": null, "resp": null, "gmap_id": "0x875287dced2a1f1f:0xf3764a9211d4f382", "relevant": "Yes"}
{"user_id": "100140684518134981776", "name": "Megan Tineo", "time": 1619051439422, "rating": 5, "text": "Jenny is the most personable and professional nail technician I have ever met. She truly has a passion for her work and your nail health. Find an idea of what you want and she can do it exactly how you want.\n\nKyla is the sweetest hair stylist! She always makes sure that I am comfortable and lessens my hair cut anxiety. She also has the best recommendations to make sure my hair is as healthy as can be!", "pics": null, "resp": {"time": 1619727721048, "text": "Thank you for your kind review! Jenny and Kyla are amazing and we are so happy you have enjoyed them and trusted us with your hair and nail services"}, "gmap_id": "0x875287dced2a1f1f:0xf3764a9211d4f382", "relevant": "Yes"}
{"user_id": "114674124924177923594", "name": "Megan Acker", "time": 1613000312226, "rating": 5, "text": "This last Friday, February 5th 2021, I had the honor of having my hair done my Holly! I have been having a really rough time the past few months with my self image and my anxiety and depression. Fortunately for me, Holly is THE best! She made sure she understood what I wanted and was very clear and even explained what colors and types of dye that she was using. It made me feel understood and comfortable! Every time I have seen myself in the mirror since has made me smile. My sister also loves her and we both go to see her! While we were there she was so attentive and kind! She feels like family! And with my sister being pregnant, it was really comforting to see that all the employees were wearing masks. Also there was plenty of space between each client.   I also appreciate that I feel like she recommends products that actually are useful to my situation. I can tell that she really cares about my hair and isn’t lazy or pushy when it comes to recommendations. She truly is an amazing hairdresser and person! She is professional and personable all at the same time!", "pics": null, "resp": null, "gmap_id": "0x875287dced2a1f1f:0xf3764a9211d4f382", "relevant": "Yes"}
{"user_id": "102386065238607685586", "name": "Debra Thrall", "time": 1628229877450, "rating": 1, "text": "She did a awfully job I have been crying ever since.  I wanted it more blonde and she turned it grey and didn't even cover up my dark roots .  I was more blonde when I went in there now I am dishwater grey I was so disappointed I felt like she didn't know what she was doing\nShe touched up the back and I have a big brown spot . So I am grey brown .  She reuned my hair.   I am so sad. I don't know what to do .  And she said it was a partial then why didn't it match the rest of my hair it was a full die job and I was charged 175 when I was told 160 for a full weave and then got a partial for 175 confusing.  I wish I would have never went there", "pics": null, "resp": null, "gmap_id": "0x875287dced2a1f1f:0xf3764a9211d4f382", "relevant": "Yes"}
{"user_id": "115610775303719226602", "name": "Melia Darger", "time": 1604766825731, "rating": 5, "text": "Not only is the vibe glamorous as sophisticated, the team is experienced, friendly and attentive. Their customer service is amazing as well. I highly recommend getting your nails done by Jenny, who is meticulous and experienced. She took her time to make sure I left with perfect nails.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMmfGZ3QoW3fLFK_kfQ8924-31clODidXZ-wfxg=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x875287dced2a1f1f:0xf3764a9211d4f382", "relevant": "Yes"}
{"user_id": "100549281257128036190", "name": "Kristin Johnston", "time": 1606589583162, "rating": 5, "text": "When you first walk in, you are greeted by the sweetest receptionist and you'll be captivated by the atmosphere. It has an extremely sophisticated look and feel to it.\nI hadn't had a hair cut in 5 years and took a leap of faith and booked with Andre. Let's just say I will NEVER let another person touch my hair. He listened to what I wanted and made my hair dreams come true. 6 months later, my hair is still healthy and shiny. I try to come see him once a month for a blow out, not only because he does the best curls this side of Utah has ever seen, but his scalp massages are to die for. I'm almost 4 months pregnant and it is so relaxing to sit in his chair and be pampered.\nIf you're not seeing Andre, you're really missing out on giving your hair the love and attention it deserves and needs.", "pics": null, "resp": null, "gmap_id": "0x875287dced2a1f1f:0xf3764a9211d4f382", "relevant": "Yes"}
{"user_id": "115072951761790345017", "name": "Cassandra Wilder", "time": 1608524430976, "rating": 5, "text": "Absolutely amazing on every level. I was blown away by their customer service, kindness and quality of work. My mom and I came in for manicures and loved chatting with the techs. Our nails turned out gorgeous too. The space is also gorgeous. It’s been a long time since I experienced this great of customer service so I immediately booked a hair appointment too. Will happily support this biz because I so appreciate the full experience they’ve created. Thank you 💕", "pics": null, "resp": null, "gmap_id": "0x875287dced2a1f1f:0xf3764a9211d4f382"}
{"user_id": "111040745692291641542", "name": "Jenifer Temple", "time": 1605217214520, "rating": 5, "text": "I cannot rave about The Boujee Bar enough! After several disappointing  hair appointments at other salon services (even one that left me with pink hair and in tears), I called on the Boujee Bar for a color correction appointment. Liv was the stylist scheduled for my appointment and she absolutely rocked it! She has earned my loyalty for as long as she will be styling hair! Liv took the time to learn about my hair journey, the products that I use, my hair routine, what I hated about my hair, as well as the desired result. She nailed the color I was going for and completely corrected all the little things that were wrong with my hair. Well done Liv and well done Boujee Bar!", "pics": null, "resp": null, "gmap_id": "0x875287dced2a1f1f:0xf3764a9211d4f382", "relevant": "Yes"}
{"user_id": "106666423877587233661", "name": "Melea Tretsky", "time": 1610663353953, "rating": 5, "text": "When I describe how I want my hair to look each time, it turns out exactly like I imagine it looking! Plus I get the best head/hair shampoo & massage from anywhere I’ve ever gone!", "pics": null, "resp": null, "gmap_id": "0x875287dced2a1f1f:0xf3764a9211d4f382", "relevant": "Yes"}
{"user_id": "107250825894203882028", "name": "Hannah Long", "time": 1614380708575, "rating": 5, "text": "Jenny is A.M.A.Z.I.N.G!!!! She did the world's cutest design and was so personable and made me feel so comfortable! Highly highly recommend!", "pics": null, "resp": {"time": 1619727862748, "text": "Thanks Hannah! We appreciate your review and look forward to seeing you again"}, "gmap_id": "0x875287dced2a1f1f:0xf3764a9211d4f382", "relevant": "Yes"}
{"user_id": "101794540814033126393", "name": "Debbie Nilsen", "time": 1614969738402, "rating": 5, "text": "I was visiting Utah and booked an appointment at the Boujee Bar. I received the best highlights and haircut from Nyna!! She was amazing and the BB is beautiful! My blonde is perfect! I have gone back twice and fly from Miami to see Nyna!!\n\nI also get a pedicure from Jenny which is pure heaven! She takes such pride in making my toes look perfect and her massage is to die for!! So awesome! I get the \"not your basic pedicure\" and it includes a scrub, massage paraffin and hot rocks!!! Seriously the best!!", "pics": null, "resp": {"time": 1619727797276, "text": "Thank you for your kind words and great review!\nWe love hearing that Nyna and Jenny have and will continue to make you happy!"}, "gmap_id": "0x875287dced2a1f1f:0xf3764a9211d4f382", "relevant": "Yes"}
{"user_id": "117196606055459452413", "name": "Malika E", "time": 1603718356162, "rating": 4, "text": "Absolutely LOVED getting my hair done by Liv. She is incredible and I look forward to getting my hair done by her again. She took her time to make sure everything was perfect. I took off a star because while my stylist was wonderful at following COVID-19 guidelines, the other stylists who were in the salon were not wearing masks, nor were the clients. I should not have to ask an employee to wear a mask. I will be liv’s client wherever she goes, because she is fabulous. However I will not be returning to this salon until the pandemic is over.", "pics": null, "resp": null, "gmap_id": "0x875287dced2a1f1f:0xf3764a9211d4f382", "relevant": "Yes"}
{"user_id": "105055470119071361759", "name": "Analee Elfervig", "time": 1574435562371, "rating": 5, "text": "I had my first experience at the Boujee Beauty Bar, and it was everything you would expect with a salon this beautiful. I had set up a day for my girls and I to all come in at the same time for blowouts. On this particular day, they only had three stylus available at the time I needed. They arranged their schedule to accommodate five girls at once. I loved the paraffin wax treatment that came with our blowouts, the head massage was incredible and I loved the style Andre gave me. The entire staff was friendly, inviting and accommodating. If you are looking for a place to get pampered, this is it! I will definitely be returning regularly.", "pics": null, "resp": null, "gmap_id": "0x875287dced2a1f1f:0xf3764a9211d4f382", "relevant": "Yes"}
{"user_id": "104263698957540843026", "name": "Haylo TattooArtist", "time": 1580262960259, "rating": 5, "text": "I can’t say enough amazing things about this place!\n\nI have been several times for different services, and each professional was personable, kind, witty, and fun to converse with!\n\nThe staff smiles, laughs, and really shows they enjoy being a part of such a beautiful establishment!\n\nI even took my 7 year old daughter for some mommy/daughter pampering. She loved it! The stylists treated us both like royalty, and made our hair look fantastic!\n\nTheir high end products, friendly & personable staff, fun atmosphere and STELLAR mood lighting keeps me coming back!\n\nThe Owners and staff truly go above and beyond to make the Boujee Bar an amazing experience 💗", "pics": null, "resp": null, "gmap_id": "0x875287dced2a1f1f:0xf3764a9211d4f382", }
{"user_id": "111183461691327344741", "name": "Laurel Roberts", "time": 1611160059888, "rating": 5, "text": "Emily is so talented and always helps me to look my best and feel beautiful!", "pics": null, "resp": null, "gmap_id": "0x875287dced2a1f1f:0xf3764a9211d4f382", "relevant": "Yes"}
{"user_id": "117241593607886360339", "name": "Katherine Murphy", "time": 1579196405891, "rating": 5, "text": "I’ll be honest, I was a little nervous trying a new place to get my hair done, my thoughts were...what if it’s to fancy in there and I’m not comfortable or what if they don’t really listen to what I want and I look worse than when I walked in, trust me my hair was a disaster! I can happily say THIS WAS THE BEST CHOICE EVER!!!\nKyla was absolutely amazing!!! She listened to all the things I didn’t want and she gave me everything I asked for and more!!! She is hands down the best with color, cut and style!!! I have never been to a more beautiful salon!!! The entire staff was so kind and accommodating, they made sure I felt special and well taken care of!!! I cannot say enough about The Boujee Beauty Bar!!! Simply the best!!!", "pics": null, "resp": null, "gmap_id": "0x875287dced2a1f1f:0xf3764a9211d4f382", "relevant": "Yes"}
{"user_id": "117036370470400930423", "name": "Jeanette Bergren", "time": 1600991666565, "rating": 5, "text": "Had a pedicure with Jauna. She is an absolute delight and very good at her profession. Give her an hour of your time and she’ll give you a relaxing experience, with an end result of beautiful toes.", "pics": null, "resp": null, "gmap_id": "0x875287dced2a1f1f:0xf3764a9211d4f382", "relevant": "Yes"}
{"user_id": "109495197581448137096", "name": "Kymberly Pace", "time": 1598482581566, "rating": 5, "text": "I was amazed by the kindness of these ladies. I\nwas originally on-time to my appointment but, because of an unexpected wave of crippling menstrual cramps, I spent the first 30 minutes of my appointment on the bathroom floor, unable to stand. When I was finally able to exit the bathroom sweating and shaking, all the girls took care of me like they were all my closest friends. They sat me down with extra pillows surrounding me, a blanket, an asprin and water. Even though they had to stay late because of me, they were understanding, patient and so so sweet about it. I won't go anywhere else.", "pics": null, "resp": null, "gmap_id": "0x875287dced2a1f1f:0xf3764a9211d4f382", "relevant": "Yes"}
{"user_id": "109073405927562659741", "name": "Brenda Van", "time": 1581979764246, "rating": 5, "text": "I loathe combing and doing my hair only because I have so much hair and I’m just awful at styling it. It’s usually in a messy “mom” bun.so I decided to try getting a blowout! It was a wonderful experience! Jenn did such an amazing job! I’ve never had my hair look so gorgeous curled. I got so many compliments that day and the next. It lasted and looked great the next day which was a super win for me. My hair was definitely a challenge and Darci was a trooper and stepped in the comb my hair along side jenn. They were a wonderful team! Sydney was also a sweet heart as well. Genuine enjoy every minute being there, I even got a cute Valentine’s Day donut.", "pics": null, "resp": null, "gmap_id": "0x875287dced2a1f1f:0xf3764a9211d4f382", "relevant": "Yes"}
{"user_id": "117296277960541075530", "name": "Wendy Macey", "time": 1580331351830, "rating": 5, "text": "Loved loved LOVED this place.  Excellent stylist and reception staff. Beautiful atmosphere,  well appointed.  My hair looked amazing.  Highly recommend.", "pics": null, "resp": null, "gmap_id": "0x875287dced2a1f1f:0xf3764a9211d4f382", "relevant": "Yes"}
{"user_id": "115315261759470228849", "name": "Hollie Miska", "time": 1582134158780, "rating": 5, "text": "Can’t say enough good things about this place!! I’ve come here since they’ve opened and each time is always special and amazing. Today I came to get a Blow out for date night and the stylist Holly gave me amazing curls with amazing volume! The front receptionist Taylee is always so bubbly, kind and helpful. Will always be a repeat customer ❤️❤️❤️", "pics": null, "resp": null, "gmap_id": "0x875287dced2a1f1f:0xf3764a9211d4f382", "relevant": "Yes"}
{"user_id": "109035230613617139140", "name": "Michelle Young", "time": 1579460144108, "rating": 2, "text": "*****Update 01/19/20  I am adjusting my review because of the experience I had yesterday. To keep it short, I arrived 11 minutes late for my appointment but still within the salons 15 minute late policy. The receptionist acknowledged this fact but said sorry, the technician had an appointment right after me and they were super  busy so, I would not be able to receive my service.\n\nA beautiful salon cannot compensate for bad customer service. I take responsibility for being late and had I been in violation of their policy, I would have accepted the fact that I forfeited my appointment. However, I still arrived within their late policy window and should have received the service I came in for instead of being refused***\n\nJauna was awesome! My nails look amazing and she was great to answer my questions and give solutions to current nail concerns. Salon is beautiful and staff is super friendly! Glad I found them!", "pics": null, "resp": {"time": 1572362660877, "text": "Hi Michelle! Jauna is so knowledgeable, I’m glad she was able to help you!\nWe are glad you found us too! Hope to see you again soon and thank you for the review and kind words"}, "gmap_id": "0x875287dced2a1f1f:0xf3764a9211d4f382", "relevant": "Yes"}
{"user_id": "116578686733856283034", "name": "Lily Stowbridge", "time": 1563244672008, "rating": 5, "text": "If i'm being completely honest.... i could spend the rest of my life here. The staff is all super sweet and very accommodating. Whitney N did an amazing job on my nails and was so friendly and genuinely cared about my experience. The same goes for Darci, she gave me the best scalp massage of my life. I am already booked for my next nail appointment. I promise you if you go here it will not disappoint.", "pics": null, "resp": {"time": 1567298400923, "text": "We love hearing that you enjoyed your time with us. Thank you for the sweet review! See you again soon!"}, "gmap_id": "0x875287dced2a1f1f:0xf3764a9211d4f382", "relevant": "Yes"}
{"user_id": "100715303343943776005", "name": "Emma Otteson", "time": 1571544752466, "rating": 5, "text": "Cam is the best nail technician I have ever been to. Her nail art is out of this world, she keeps everything so tidy, and is very personable with me. Seriously, if you are wondering where you should go get an amazing manicure and some great HAND PAINTED art, Cam is the place to go.", "pics": null, "resp": {"time": 1572362502204, "text": "Thank you for the kind review Emma! We agree, Cam is bomb at tidiness and nail art.\nHopefully we will see you again soon!!!"}, "gmap_id": "0x875287dced2a1f1f:0xf3764a9211d4f382", "relevant": "Yes"}
{"user_id": "106891551034550487711", "name": "Bonnie Loveridge", "time": 1582397157156, "rating": 5, "text": "I LOVE Andre! He is amazing! Knows his trade and it’s nice to just say “Do what you want” and actually love the results. He’s my complete go-to! Love you Andre and the whole beauty bar team!!!!", "pics": null, "resp": null, "gmap_id": "0x875287dced2a1f1f:0xf3764a9211d4f382", "relevant": "Yes"}
{"user_id": "102102773764718546862", "name": "Lexie Romero", "time": 1563294236905, "rating": 4, "text": "Beautiful salon. Very nice staff. The bubbly drink they serve you is really delicious. One of my nails ripped off the day after I got them done and they were able to get me in asap to have it fixed at no cost. However, I won't be able to keep coming back due to the nail fills being $50+. I also don't like the top coat, it's not very shiny. One of my jewels from the nail art fell off just two days after which was a bummer too. All in all, it's worth checking out! I'd love to get my hair styled one day. Book with Shaley for beautiful nails!", "pics": null, "resp": {"time": 1567298491735, "text": "Thanks for coming and seeing us Lexie!\nWe have purchased a new top coat that everyone is LOVING. Please come see us again soon. Come try a blowout!"}, "gmap_id": "0x875287dced2a1f1f:0xf3764a9211d4f382", "relevant": "Yes"}
{"user_id": "103853070565512376662", "name": "Ken Black", "time": 1573006809122, "rating": 5, "text": "My entire experience here was so comfortable, and fun! Cass gave me a full set that i wanted For my birthday, and they’re amazing! They immediately made me feel welcome.", "pics": null, "resp": null, "gmap_id": "0x875287dced2a1f1f:0xf3764a9211d4f382", "relevant": "Yes"}
{"user_id": "101389275252813207981", "name": "Amber Skinner", "time": 1583800963658, "rating": 2, "text": "My daughter and I had heard great things about Boujee Bar, we decided to give it a try and both got pedicures (the not so basic) we were disappointed. The cost is not worth the quality. The girls were very nice, but everything they did we’ve had done at other salons for half the cost, the paint job was done poorly on my daughter she requested nail art which they couldn’t do. I don’t think we’ll be back.", "pics": null, "resp": {"time": 1584035912185, "text": "Hi Amber, we are so sorry to hear that your experience wasn’t what you expected. We would love to offer you each a gift card to come back and use on either a hair service or we can have you try a different nail technician.\nFor future reference, if you are unhappy with your service please let us know and we can fix it. Thank you so much for reaching out with your concerns, we strive to be greater each day.\nPlease give us a call and the manager will get right back to you."}, "gmap_id": "0x875287dced2a1f1f:0xf3764a9211d4f382", "relevant": "Yes"}
{"user_id": "110386760556857490698", "name": "Kristin Vazquez", "time": 1583646910165, "rating": 5, "text": "Liv, my Senior Stylist, knew just what I needed!! Super on trend, she juxtaposed my wishes with new and fresh ideas! I loved my experience with Liv, and adore Boujee! Highly recommended.", "pics": null, "resp": null, "gmap_id": "0x875287dced2a1f1f:0xf3764a9211d4f382", "relevant": "Yes"}
{"user_id": "108334649966522517244", "name": "Rachel Richards", "time": 1583730304099, "rating": 5, "text": "It was so easy to book an appointment, people are super nice! Loved Jennifer! She did a great job and I am excited to go back!", "pics": null, "resp": null, "gmap_id": "0x875287dced2a1f1f:0xf3764a9211d4f382", "relevant": "Yes"}
{"user_id": "104379016985480417281", "name": "Leata Hunt", "time": 1563049545785, "rating": 5, "text": "Ladies, listen up😘 If you are wanting to look absolutely stunning & fabulous no matter the occasion, please show up and see my girl Loni🌺 She is the sweetest beautician in the world and she will ensure to doll your hair up like the Queen that you are👑 Check out their $40 luxurious pampered up summer promotion going HOT right now!!! Don’t miss out & bring a friend with you to get their hair done🤩🤩🤩 Thanks Loni, you’re the absolute best!!!", "pics": null, "resp": {"time": 1567298363125, "text": "Thank you Leata! We hope to see you again soon!"}, "gmap_id": "0x875287dced2a1f1f:0xf3764a9211d4f382", "relevant": "No, advertisement"}
{"user_id": "105799314457330405820", "name": "Rylee Remington", "time": 1565400714021, "rating": 5, "text": "This place is honestly so beautiful! 😍 I got my very first Boujee blowout and it felt AMAZING! ❤️ Lana was definitely so welcoming and had me looking beautiful to begin a stressful day at work! 😊\nWILL BE GOING BACK😌", "pics": null, "resp": {"time": 1567298637221, "text": "I’m so glad we could make you feel amazing, everyone deserves that! Please come see us again soon and thank you for the review!"}, "gmap_id": "0x875287dced2a1f1f:0xf3764a9211d4f382", "relevant": "Yes"}
{"user_id": "107075747176443094865", "name": "Ellen Xanthos", "time": 1581644130895, "rating": 5, "text": "I really enjoy coming here whenever I can! It’s incredibly relaxing and great to feel so gorgeous afterward and every stylist I’ve had is so talented!", "pics": null, "resp": null, "gmap_id": "0x875287dced2a1f1f:0xf3764a9211d4f382", "relevant": "Yes"}
{"user_id": "100104803478618893657", "name": "Gabrielle Coon", "time": 1575846080970, "rating": 5, "text": "Absolutely beautiful salon. Even more amazing staff! Can't wait to go back for more services!", "pics": null, "resp": null, "gmap_id": "0x875287dced2a1f1f:0xf3764a9211d4f382", "relevant": "Yes"}
{"user_id": "100027262612336183058", "name": "Natalie H", "time": 1569381217174, "rating": 1, "text": "I will start by saying the space is absolutely beautiful, a very calming and relaxing atmosphere. The products are very high end, which I appreciate.\n\nUnfortunately, the service I received did not match the atmosphere. I booked my appointment online for 9 am. I arrived a few minutes before 9:00 and the person providing the service had not yet arrived, which was fine. I ended up waiting for a little over 15 minutes past my appointment time for her to arrive. When she did arrive, there was no apology for running late or a thank you for waiting, nothing. So we went back and the service started. With the gel nail polish removal, the tool slipped out of her hand and nicked my toe, again, no apology or asking if I was ok (and I was fine, however an indication of making sure of that is showing a basic level of customer service.) The rest of the nail polish application was fine.\n\nThe soaking, scrubbing, and massage were all very quick, which was extremely disappointing. The most disappointing was how quick the massage was. When I am paying this price point, I expect a much, much better and longer massage.  My pedicure started at 9:17/9:18 am and ended at 10:07 am. The online booker indicated the service was 1 hour, 15 minutes. The service I received was nowhere near that time frame.\n\nI am always happy to pay a premium price tag for exceptional service, which is why I was excited to try the location and service out. I am extremely disappointed and I did not receive anywhere near the level of service I expect for The price I paid. I think the most disappointing part is I emailed the company sharing my experience before I posted a review. I received a very generic response and still no apology or indication I was valued as a customer. I will not return or recommend this salon to anyone.", "pics": null, "resp": null, "gmap_id": "0x875287dced2a1f1f:0xf3764a9211d4f382", "relevant": "Yes"}
{"user_id": "118077847224698844810", "name": "Dori Moody", "time": 1571449127237, "rating": 5, "text": "So awesome people work there and I know the owner and they are so awesome people! I would love to go there again whenever I need it.", "pics": null, "resp": {"time": 1572362752555, "text": "Thank you Dori! Come visit us again soon!"}, "gmap_id": "0x875287dced2a1f1f:0xf3764a9211d4f382", "relevant": "Yes"}
{"user_id": "118370774658071517273", "name": "Jayde Walden", "time": 1581884486226, "rating": 5, "text": "I came for a blowout and was with Jenn, she’s amazing with braids and I was left feeling confident and happy. If you’re in this area needing stylist, she’s your girl.", "pics": null, "resp": null, "gmap_id": "0x875287dced2a1f1f:0xf3764a9211d4f382", "relevant": "Yes"}
{"user_id": "108574923324886183728", "name": "Jesuslovesyou", "time": 1574735450479, "rating": 3, "text": "My ONLY gripe is the online website. When I set up the appointment online made me pay upfront for my appointment which I’ve never had to do anywhere. Ok.. fine. Then I find out that it doesn’t even set my appointment I have to call to make it, Ok that’s annoying. I call the receptionist tells me that it was a mistake on the website I shouldn’t have had to pay up front and show them a screen shot from my bank if the money came out (which it did), she’s talked with her manager they will refund me and waive the fees. I clarify cause what does this mean then? So your going to refund me the money then I have to pay again at time of service? No she says we will refund and you and this service will be on us...Well that’s awesome!! Day of service comes. Guess what doesn’t happen...the receptionist keeps telling me I can refund and pay again or just have it be paid for I explain what’s been told to me she says right you can be refunded and pay right now... why would I do that??? .Maybe communication was miss crossed, who knows. I’m not looking for free service, just don’t like the website making you pay for services that haven’t happened yet. Also, don’t like being told something will happen then being looked at like I’m a total nut job!", "pics": null, "resp": {"time": 1574881276908, "text": "We are so sorry for the inconvenience Marissa! When launching our new website there was an issue with scheduling. We have since corrected to problem.\nWe do require a card on file for our cancellation policy, but are not charged unless there is a no show or less than 24 hour minute cancellation.\nUnfortunately there was a glitch in the system for a couple of days when the new site was launched.\nWe loved having you and your friend visit us and can’t apologize enough for the confusion with the receptionist."}, "gmap_id": "0x875287dced2a1f1f:0xf3764a9211d4f382", "relevant": "Yes"}
{"user_id": "109208282425226768202", "name": "John Lambert", "time": 1564250051225, "rating": 5, "text": "Had a great time visiting this Draper beauty place. The interior is gorgeous!  I had my MANicure and pedicure done by Jauna. She was very friendly and knowledgeable.  I was well taken care of.  My nails got nicely cleaned up and hands and feet felt phenomenal from the paraffin wax. I will definitely get them done again whenever I am in Draper.  The receptionist, Sydney and Hunter also took great care of me as well, making sure I had drinks and was well taken care of. I recommend this place. What a great experience all around. Such wonderful employees!", "pics": null, "resp": {"time": 1567298541966, "text": "I love hearing how well you were treated. Thank you for sharing! See you again when you’re back in Draper!"}, "gmap_id": "0x875287dced2a1f1f:0xf3764a9211d4f382", "relevant": "Yes"}
{"user_id": "107900022338612616098", "name": "Clay Bauer", "time": 1571458072476, "rating": 5, "text": "If anyone is looking to pamper their special someone, you NEED. To take them to the Bougee Beauty Bar. The customer service is above and beyond SPECTACULAR! Your Special Someone or yourself will absolutely LOVE IT!!", "pics": null, "resp": {"time": 1572362727348, "text": "Thank you Clay! We love hearing you’ve enjoyed our staff. They are amazing. Please come pamper yourself soon!"}, "gmap_id": "0x875287dced2a1f1f:0xf3764a9211d4f382", "relevant": "No, advertisement"}
{"user_id": "105963118330364482699", "name": "Jackie Peterson", "time": 1571508760318, "rating": 5, "text": "Gotten my past few manicures here and I’ve never had a better manicure! They really take their time and my nails have never looked better. The hand scrub massage treatment at the end really takes the experience to the next level!", "pics": null, "resp": {"time": 1572362561639, "text": "That Oribe Hans scrub and lotion is to die for! Thank you for your kind words and review Jackie! We sure appreciate your business and hope to see you soon!"}, "gmap_id": "0x875287dced2a1f1f:0xf3764a9211d4f382", "relevant": "Yes"}
{"user_id": "108989914454926508326", "name": "Lisa Kireiev", "time": 1565651330506, "rating": 5, "text": "Such a beautiful atmosphere!!! Sara D. nailed (literally) my acrylic set!!! So happy I get to come here every other week!!! Well done!!!", "pics": null, "resp": {"time": 1567298663137, "text": "We loved having you. Thank you for the review1"}, "gmap_id": "0x875287dced2a1f1f:0xf3764a9211d4f382", "relevant": "Yes"}
{"user_id": "106633954749016358544", "name": "Heather P", "time": 1568695895363, "rating": 2, "text": "So beautiful!! I did a mani/pedi for the price I paid I was expecting it to be the best mani pedi I have ever received. While my nails did look nice here are the things I look for in a mani/pedi that I did not receive:\nMani\n- cuticles were not taken care of, leading to cuticles tearing in the days after. One nails cuticle wasn’t touched at all and looks like it has been a month since I got my nails done. (It’s only been a little over a week and a half.\n- under and around my nails weren’t even touched. I had to go home and clean under my nails.\n- paraffin wax - did not cover the whole top pet of my hand. Maybe a third of it.\n- massage - I get my nails done for the hand and arm massage. Even a little bit on the shoulders. At this price point this should be part of the experience.\nPedi\n- Chairs are super pretty but I really missed the massage chair that you get in every other salon I’ve been to.\n- again cuticles were not cleaned up and around toe nail beds were not cleaned up.\n- there was a couple minute foot massage. While this felt great it should have been longer. And legs should have been massaged too.\n-paraffin wax - again didn’t cover entire foot\n\nAll in all - maybe I’ll try a blowout from them but I will not be returning to get my nails done. The atmosphere is amazing, everyone is so nice, but if you want to charge over $100 for a mani/pedi they need to make it worth it.", "pics": null, "resp": null, "gmap_id": "0x875287dced2a1f1f:0xf3764a9211d4f382", "relevant": "Yes"}
{"user_id": "110874693722306401014", "name": "Kimberly Hall", "time": 1591066574491, "rating": 5, "text": "Beautiful Salon , love the hair services💞", "pics": null, "resp": null, "gmap_id": "0x875287dced2a1f1f:0xf3764a9211d4f382", "relevant": "Yes"}
{"user_id": "111055537001345643816", "name": "H M", "time": 1572395475519, "rating": 2, "text": "Prices are ridiculous, they are too snobby\nEdited to owner: I know a salon I can go get a beautiful full set for $45 from someone more experienced than anyone at this salon, and it’s gonna be more homey and not as snobby", "pics": null, "resp": {"time": 1572361889712, "text": "Hi HM. We are honestly shocked and surprised to hear this. We pride ourself in the staff we hire, and know without a doubt that every person here has a huge heart, is friendly, kind, and wants to make everyone feel happier and more beautiful once they leave our building. Most all of our reviews rave about how kind our staff is, even the lower reviews.\nWe also have studied our pricing and found it to be very comparable to other high end places in the area.\nWe use top of the line products, provide a one of a kind environment, and hire amazing stylists and nail techs. Unfortunately, pricing for those type of things is not going to be comparable to smaller, less luxurious salon.\nWe do know that some people would rather go to a place that isn’t as luxurious because they prefer “cheap”, and that’s not the type of guest that comes to Boujee.\nBoujee is for the guest who values a great customer experience and high end environment.\nPlease reach out to us directly to share your experience, as we would love to correct the problem if there was one."}, "gmap_id": "0x875287dced2a1f1f:0xf3764a9211d4f382", "relevant": "No, advertisement"}
{"user_id": "113314532487909028965", "name": "David Muñoz", "time": 1579914263855, "rating": 5, "text": "Beautiful place", "pics": null, "resp": null, "gmap_id": "0x875287dced2a1f1f:0xf3764a9211d4f382", "relevant": "Yes"}
{"user_id": "114667162957874545410", "name": "Jordie Fuller", "time": 1580785062965, "rating": 5, "text": null, "pics": null, "resp": null, "gmap_id": "0x875287dced2a1f1f:0xf3764a9211d4f382", "relevant": "No"}
{"user_id": "112130340139015842973", "name": "Anne Herbert", "time": 1571440692926, "rating": 5, "text": null, "pics": null, "resp": null, "gmap_id": "0x875287dced2a1f1f:0xf3764a9211d4f382", "relevant": "No"}
{"user_id": "111043445534045884445", "name": "Nyna Nilsen", "time": 1613020906925, "rating": 5, "text": null, "pics": null, "resp": null, "gmap_id": "0x875287dced2a1f1f:0xf3764a9211d4f382", "relevant": "No"}
{"user_id": "118136532674514050405", "name": "Celeste Anguiano", "time": 1623072475924, "rating": 5, "text": null, "pics": null, "resp": null, "gmap_id": "0x875287dced2a1f1f:0xf3764a9211d4f382", "relevant": "No"}
{"user_id": "103007346295044273990", "name": "Ezra Dunyon", "time": 1602995981727, "rating": 5, "text": null, "pics": null, "resp": null, "gmap_id": "0x875287dced2a1f1f:0xf3764a9211d4f382", "relevant": "No"}
{"user_id": "108902474129191098964", "name": "Marina Rodriguez", "time": 1603577470425, "rating": 5, "text": null, "pics": null, "resp": null, "gmap_id": "0x875287dced2a1f1f:0xf3764a9211d4f382", "relevant": "No"}
{"user_id": "115325591526967118040", "name": "Katelyn Shoemaker", "time": 1612845632830, "rating": 3, "text": null, "pics": null, "resp": null, "gmap_id": "0x875287dced2a1f1f:0xf3764a9211d4f382", "relevant": "No"}
{"user_id": "100217552787897641896", "name": "Rylee Jones", "time": 1566432339019, "rating": 5, "text": null, "pics": null, "resp": null, "gmap_id": "0x875287dced2a1f1f:0xf3764a9211d4f382", "relevant": "No"}
{"user_id": "108989289918803288131", "name": "Arbo TM", "time": 1583365447211, "rating": 5, "text": null, "pics": null, "resp": null, "gmap_id": "0x874d97b9dad3d465:0x6db57c1c9bdd72fe", "relevant": "No"}
{"user_id": "116821322397270096022", "name": "Shaun Mayhew", "time": 1595839619292, "rating": 1, "text": "Pulled in all the time. Waist time, never in a hurry. Moody, unprofessional, got the don't talk to me unless I talk to you attitude. The positive reviews are for things they are supposed to do...letting vehicles stay there for sleep and the like. If you get a ticket you'll be found guilty, so take it to a higher coart, for a fair shake.", "pics": null, "resp": null, "gmap_id": "0x8753700e341490ef:0x31d1c3758a01e093", "relevant": "Yes"}
{"user_id": "101169766155703000543", "name": "Dick Bess", "time": 1604673847527, "rating": 5, "text": "Awesome to deal with ....thanks", "pics": null, "resp": null, "gmap_id": "0x8753700e341490ef:0x31d1c3758a01e093", "relevant": "Yes"}
{"user_id": "108989289918803288131", "name": "Arbo TM", "time": 1606325904529, "rating": 5, "text": "Always curtious", "pics": null, "resp": null, "gmap_id": "0x8753700e341490ef:0x31d1c3758a01e093", "relevant": "No"}
{"user_id": "103044507055688788554", "name": "Airjockey", "time": 1424579305395, "rating": 5, "text": "Thank you so much for allowing me to take my 10 hour break here , was really low on hours due to the influx of trucks in Salt Lake City Utah due to I-80 being closed. I really appreciate it, was pulling my hair out to find a place to park. Thanks Again !!!!!", "pics": null, "resp": null, "gmap_id": "0x8753700e341490ef:0x31d1c3758a01e093", "relevant": "Yes"}
{"user_id": "110292128913886119280", "name": "Eamon Sigler", "time": 1471386601369, "rating": 5, "text": "Dale was a cool guy! Helping us with our loads at E&L Transports LLC! It's always a pleasure stopping here!", "pics": null, "resp": null, "gmap_id": "0x8753700e341490ef:0x31d1c3758a01e093", "relevant": "Yes"}
{"user_id": "108571919627249564912", "name": "Ladds Towing", "time": 1535143187992, "rating": 5, "text": "Very polite officers, officer clark was awesome! Thank you from Ladds Towing", "pics": null, "resp": null, "gmap_id": "0x8753700e341490ef:0x31d1c3758a01e093", "relevant": "Yes"}
{"user_id": "105052418963029864255", "name": "Matt Beedle", "time": 1521481249776, "rating": 3, "text": "Southbound prepass transponder always works, Northbound prepass transponder never works.  And I'm always empty headed northbound.", "pics": null, "resp": null, "gmap_id": "0x8753700e341490ef:0x31d1c3758a01e093", "relevant": "Yes"}
{"user_id": "103667026484881924645", "name": "Daniel George", "time": 1489246022927, "rating": 5, "text": "I had a question about a change in regulations. The person on the phone was very helpful and answered my question quickly.", "pics": null, "resp": null, "gmap_id": "0x8753700e341490ef:0x31d1c3758a01e093", "relevant": "Yes"}
{"user_id": "112454358047676915318", "name": "Cheryl Dutton", "time": 1596521648602, "rating": 5, "text": null, "pics": null, "resp": null, "gmap_id": "0x8753700e341490ef:0x31d1c3758a01e093", "relevant": "No"}
{"user_id": "112826382255606121062", "name": "Sarvar Svanidze", "time": 1418929084197, "rating": 1, "text": null, "pics": null, "resp": null, "gmap_id": "0x8753700e341490ef:0x31d1c3758a01e093", "relevant": "No"}
{"user_id": "103839743190196591252", "name": "Kevin Richardson", "time": 1623469573187, "rating": 4, "text": null, "pics": null, "resp": null, "gmap_id": "0x8753700e341490ef:0x31d1c3758a01e093", "relevant": "No"}
{"user_id": "103802672510604542018", "name": "Steven Wright", "time": 1393643439317, "rating": 3, "text": null, "pics": null, "resp": null, "gmap_id": "0x8753700e341490ef:0x31d1c3758a01e093", "relevant": "No"}
{"user_id": "110616622954950383143", "name": "LK Moto", "time": 1624803849991, "rating": 4, "text": null, "pics": null, "resp": null, "gmap_id": "0x8753700e341490ef:0x31d1c3758a01e093", "relevant": "No"}
{"user_id": "101244527038316791160", "name": "Kristie Buehner", "time": 1501091092192, "rating": 5, "text": "I am so pleased with the service I received from Daltile.  Russ at the order desk went above and beyond to make a bad situation great!  They are very professional, easy to work with, have the BEST selection of stone and tile and really go out of their way to provide excellent customer service.  Do yourself a favor and buy all your stone and tile here!", "pics": null, "resp": null, "gmap_id": "0x87528ae3717e7f2b:0x9ca9b2ec795c8a32", "relevant": "Yes"}
{"user_id": "108985846349073745283", "name": "Steven Gould", "time": 1447525246148, "rating": 5, "text": "Fantastic selection of designer tile. Always very helpful", "pics": null, "resp": null, "gmap_id": "0x87528ae3717e7f2b:0x9ca9b2ec795c8a32", "relevant": "Yes"}
{"user_id": "113829005619017735376", "name": "Zachary Smallwood", "time": 1501960154747, "rating": 3, "text": "Hours are wrong, said they were open until 3, closed at 1", "pics": null, "resp": null, "gmap_id": "0x87528ae3717e7f2b:0x9ca9b2ec795c8a32", "relevant": "Yes"}
{"user_id": "114850722377114722512", "name": "Louise Calvert", "time": 1458311838707, "rating": 4, "text": null, "pics": null, "resp": null, "gmap_id": "0x87528ae3717e7f2b:0x9ca9b2ec795c8a32", "relevant": "No"}
{"user_id": "104002215327309210672", "name": "Ben Simon", "time": 1629846328002, "rating": 5, "text": "We loved our van!!\n\nMy wife and I took a trip up to Grand Teton and Yellowstone National Parks. The van was so clutch! It drove super well on the highway and dirt roads. The fridge was a perfect way to keep a bunch of meals cold and the bed was super comfy. The small van was just the right size for the two of us and the checkout/check-in process could not have been easier.\n\nMakes me want to get a camper van of my own!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipO_Z7A98th2vRexNI0tGpsrIbLw0kH5MnSuVi58=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOg5-eziNKnkbrQQdXa3ITHGYuCHzcYAonN5Z9A=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNC4ILsjgMp6MuPG8P-x2qduMjVYbxAGpVZ8-UQ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPM2G8zGHNJ82HGSfIC2nfxpVFMtyCU85CZN9dZ=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8752f6a5524b4211:0x3e36cd92537e106c", "relevant": "Yes"}
{"user_id": "116837371955522912722", "name": "Stacie Vogelsang", "time": 1623607389441, "rating": 5, "text": "Three of us spent a week driving through Southern Utah. There is no better way to experience nature than immersing yourself in it 24/7. Wandervan equipped us well for the experience. We especially like the provided screens so we could leave our back doors open while camping. I appreciated the quick and always pleasant communication with the staff. We drove well over 1000 miles and loved having our accommodations with us wherever we went. I hope we can do another trip soon!!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipM6Y4F0aAbNWfl6v_hG_EcRz-q05i-Oe_3U1vvx=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMnLwDCsZQ6aKI95a8OFV4V2w6sAn9K0JGCGg9v=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8752f6a5524b4211:0x3e36cd92537e106c", "relevant": "Yes"}
{"user_id": "112885095595473226516", "name": "M Hendon", "time": 1624545098962, "rating": 5, "text": "Such a fun trip! Wandervans was great - before, during, and after the trip.\n\nThis kind experience was a stretch of my comfort zone, but I saw it as the best way with a combination of comfort and flexibility to see a number of parts of Utah. I went with a friend, so the the large van with two queen beds was ideal.  The beds were very comfortable. We slept with the doors open and mosquito nets up.\n\nThe van drove well in a variety of conditions! Highway, up and down elevation, hot conditions.\n\nI called the company several times before the trip to get ideas and help with booking details.  Very receptive each time and answered questions that I didn’t even know I had.\n\nA campervan is the best way to see Utah.  Dispersed camping is plentiful and offers schedule and what to see flexibility.  Wandervans is the best option for campervan rentals!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMoQQF54pJ9R9YfXGt4uesKMLAwXNluEsyDmsS3=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipN-Xe8j1eun7Jig19huQwGANMoxx_e-r5JZorJF=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipO6DhKRj8aXXXf7dP7OULdIVhCQOFj7GpjgXfaq=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8752f6a5524b4211:0x3e36cd92537e106c", "relevant": "Yes"}
{"user_id": "118295479284236574363", "name": "Lindsay Clark", "time": 1624594194458, "rating": 5, "text": "I LOVED my experience! I called several times with questions and concerns before my trip and every person I spoke with was friendly, kind, and knowledgeable. The van was easy to drive and had a lot more zoom than I thought it would have. It drove just as great on the freeway as on the dirt roads. The back-up camera was perfect for lining me up.\n\nThe set up inside was fantastic. There's was tons of room for all my extra chairs, coolers, boxes, and bags. I audio moved being able to take my \"house\" with me so I could change out of wet or dirty clothes after swimming or hiking.\n\nThe mosquito netting was PERFECT!! Easy to install and kept out every bug while still allowing the cool mountain breeze to come through.\n\nThe bed was comfy (brought my my own sheet and put on top of the one provided because I don't like microfiber)\n\nIt was easy to pick the van up and return. I would absolutely do this again!!", "pics": null, "resp": null, "gmap_id": "0x8752f6a5524b4211:0x3e36cd92537e106c", "relevant": "Yes"}
{"user_id": "115791304504391077268", "name": "Mary-Kay Lombino", "time": 1628165926989, "rating": 5, "text": "Wandervans is a great company. Everyone is super nice and helpful. The checkin and checkout is very easy. The large van is the perfect size for a family of 3 (or maybe 4 if some are small). The beds are comfortable and the cabin is spacious. It's great to have a fridge and sink inside the van. Tables, chairs, bedding, towels and other extras are a must to make the perfect wandering vacation!", "pics": null, "resp": null, "gmap_id": "0x8752f6a5524b4211:0x3e36cd92537e106c", "relevant": "Yes"}
{"user_id": "101733516429888512561", "name": "Cathy Haas", "time": 1625432944312, "rating": 5, "text": "We rented the medium/tall van for two adults with our supplies and bikes.\nThe online rental was easy. Communication with Wandervans was always quick and helpful. Jason was very friendly and helpful at pick up and drop off.\nThe van had plenty of storage, was comfortable and drove well. The bed was very comfortable.\nThe storage in the back and front under the bed had plenty of room for our camping equipment. We brought our own but they did have options to rent their equipment. The hooks from the ceiling were very handy in hanging our hats, jackets and garbage bag. We wish we would have brought some straps just to secure the load in storage a bit better so it didn't move around so much. We eventually figured out how to pack it tighter so there was less shifting.\nWe figured out the mosquito netting meant for the side door could also be used on the back door which allowed for a nice cross breeze through the van with the front windows open and netted. This really helped cool off the back bed area for better sleeping.\nWe are considering purchasing a camper van in the future and wanted to try one out to see if it would work for us. It gave us a good experience and lots to think about how we would arrange things and what features we would need.\nOverall a great experience!", "pics": null, "resp": null, "gmap_id": "0x8752f6a5524b4211:0x3e36cd92537e106c", "relevant": "Yes"}
{"user_id": "100648660834909671270", "name": "Kevin Bodensteiner", "time": 1628310824264, "rating": 5, "text": "Had a wonderful experience in our Wandervan! We actually had 3 people sleep in the small van. Not that I would recommend it but it worked. Comfortable ride and gas mileage was around 19 mpg.  We will certainly consider doing the Wandervan adventure again.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMuZTaainB8IWIDOz4wum_lLjdIzJqOX3CSE7s=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8752f6a5524b4211:0x3e36cd92537e106c", "relevant": "Yes"}
{"user_id": "102146927338120369070", "name": "Karen Lannom", "time": 1616527600313, "rating": 5, "text": "We loved renting the large winter Wandervan for our family.  From the moment we booked, the Wandervan folks answered all our questions. Checkout was super easy and they were extremely responsive when we had questions about the van during our trip.  The van was equipped with everything we needed and even though the weather was cold, the diesel heater kept us toasty warm. The beds were super comfy and they had dark-out curtains and window shades. I highly recommend them!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMLBueDnwTelN1-2TEdv3TlYJRgYZL7Laod0mdl=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8752f6a5524b4211:0x3e36cd92537e106c", "relevant": "Yes"}
{"user_id": "115472537019970460987", "name": "Megan Ross", "time": 1621344213472, "rating": 5, "text": "Wandervans was exceptional all around! The customer service was prompt, responsive, and creative to helping me secure a van for my dates. The location is easy and accessible. The pick up and check are are simple. Lastly, the van itself was clean, easy driving, well outfitted and made our trip! I will rent again!", "pics": null, "resp": {"time": 1621352622487, "text": "Thanks so much Megan. We’re glad you had a great trip! Looking forward to your next rental."}, "gmap_id": "0x8752f6a5524b4211:0x3e36cd92537e106c", "relevant": "Yes"}
{"user_id": "101185026450440259401", "name": "Wesley Satterwhite", "time": 1624304665656, "rating": 5, "text": "Just returned home from a 16-day epic road trip family vacation in Utah and Colorado. We saw the big five National Parks plus Great Basin NP, Dead Horse Point State Park, Mesa Verde NP, Canyon of the Ancients NM, The Million Dollar Hwy (Telluride-Ouray-Silverton-Durango), Mount Evans, and Dinosaur NM. 2 adults and 2 teenagers.\nPros: The large Wandervan was just right for our needs: slept all of us comfortably (the beds were quite comfortable!) and made it so that we didn't have to put up tents at a new campground every night--we could just roll in after a full day and climb into bed. The second row seating arrangement was great for our teenagers. A Coleman cook stove was included, along with a folding table (which we didn't need becuase we camped in campgrounds that had picnic tables). Camp chairs were provided for the four of us to sit around the fire and the radiate campfire was surprisingly effective (we were skeptical when we first saw it was essentially a cookie tin with wax and wicks). The fridge was great and kept our groceries cool, while the extra cooler we requested (and received) held extra water. There were lots of cup holders and little stoarge pockets to use while driving/riding. The van handled nicely despite its size on a variety of road types--long stretches of highway, the climb up to Mt. Evans, dirt forest service roads, interstates, and city roads in denver and SLC. The backup camera is the best we've ever seen and the blind spot mirrors are SO helpful. The van garnered MUCH attention--everywhere we went people asked us about it. Reservations were easy to make and all contacts with the company have been professional and courteous and responsive.\nCons: We did not receive a couple of items we requested and the contactless checkout left us confused as to how to get those items. The phone number on the printed manual in the glove compartment was not correct. While I understand the contactless checkout procedures, it was very odd and uncomfortable to be picking up and dropping off without seeing a single live person (even the office at the lot was empty and locked up). However, when we notified the company once we returned the van, they credited us the charges against our extra mileage. We had a small maintenance issue, which was rectified easily through the roadside assistance line with the additional insurance we purchased. The fridge kept coming unplugged and turning off the first few days until we figured out that the cord was doubled up behind it, making it stretch too far and come loose wehen my daughter jostled it with her feet where she was sitting. After we figured that out and put the slack back in, we had no further issues with the fridge. The large van is tall and that led to it being buffetted by high winds on straight Utah highways--not really something that can be fixed, but consider it when renting and adjust your driving accordingly. There is no air-conditioning when not running the engine, so sleeping can be hot (especially if you're in Southern Utah during a heat wave). The top bunk has zero ventilation so the heat there was especially bad. Rechargeable fans helped some and screens for the front windows helped some. The back screen didn't really fit well so we didn't use it. If building out new vans a window that opens on the roof or top bunk area would be a nice addition. The large van has limited storage to accommodate for the two beds, but if you plan well it's not a problem.\nAll-in-all, we would definitely do it again--it truly hits the sweet spot between tents and RV.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipNWjECqGC0eCzINvkvw8gJnM23i7RdFzJxcXvG5=w150-h150-k-no-p"]}], "resp": null, "gmap_id": "0x8752f6a5524b4211:0x3e36cd92537e106c", "relevant": "Yes"}
{"user_id": "116593919373962876655", "name": "Sonja Brower", "time": 1626830811888, "rating": 4, "text": "It was a rough start to a long trip. Unfortunately the tires weren’t inspected prior to my departure. Both front tires were warped and bald tread on the inside. Roadside assistance stated I would need to pay to replace them (Not covered) Wandervans Customer Service was helpful and upon return reached out to reimburse the cost of the replacement tires.\n\nAs for the comfort and what we used it for - Loved the room and beds", "pics": null, "resp": null, "gmap_id": "0x8752f6a5524b4211:0x3e36cd92537e106c", "relevant": "Yes"}
{"user_id": "115843044660890137867", "name": "Dominic Razzano", "time": 1600031199080, "rating": 5, "text": "Great experience we had with this van. We went from Zion to Moab and had no problems with the van and loved how comfortable we were. Very clean as well.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipOIwZoD5aKg7tohHLhG9jU-wBip49iQbywAWoLx=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMxxVbCotvFn1qFADyYT5yS0KqSQO4J09bIBf6V=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMpKBh2lbYEo2n3_TkRBoUoTAEM9c0xc0PosFPC=w150-h150-k-no-p"]}], "resp": {"time": 1601489693876, "text": "Thanks Dominic! Glad you had a fantastic trip south!"}, "gmap_id": "0x8752f6a5524b4211:0x3e36cd92537e106c", "relevant": "Yes"}
{"user_id": "109424802850872410816", "name": "Tey-Marie Astudillo", "time": 1624146618223, "rating": 5, "text": "As minimalists, my partner and I opted for a small camper van for our 9 day/8 night trip to Teton and Yellowstone. The van delivered exactly what it entailed it would, and was perfect for what we needed - a vehicle that would also serve as a comfortable home base for our hikes and excursions. At one point, we did encounter a mechanical issue with the van, but the customer service from the company, particularly by Nikole, was immensely responsive, supportive and attentive during every step and we were back on the road shortly. I would definitely use them again and recommend this company if you are looking for a comfortable mobile home base for your next adventure.", "pics": null, "resp": null, "gmap_id": "0x8752f6a5524b4211:0x3e36cd92537e106c", "relevant": "Yes"}
{"user_id": "104892946652368928599", "name": "Jesse Harding", "time": 1603919764323, "rating": 5, "text": "Great experience! We took our Wandervan on a national park trek and visited 5 parks! It was so convenient and comfortable and got great gas mileage. There were 4 of us (1 adult and 3 teenagers) and the large van fit us perfectly. Definitely would recommend to people interested in trying out the van life!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPHxnSYtbrf3k5-Oq2XRVRdIQM71tCLW_kcOf1F=w150-h150-k-no-p"]}], "resp": {"time": 1603922486012, "text": "5 parks! Amazing, glad you and your family had a great trip."}, "gmap_id": "0x8752f6a5524b4211:0x3e36cd92537e106c", "relevant": "Yes"}
{"user_id": "109982055890775230408", "name": "Jamie Ferris", "time": 1625080201677, "rating": 5, "text": "Wandervans was easy to work with. Van was clean and met our needs nicely. Had a great trip!", "pics": null, "resp": null, "gmap_id": "0x8752f6a5524b4211:0x3e36cd92537e106c", "relevant": "Yes"}
{"user_id": "114092885462227882225", "name": "Derek Stanek", "time": 1621284523555, "rating": 5, "text": "Our experience with Wandervans was OUTSTANDING.  The van was exactly as expected.  Pick up and drop off was extremely efficient and pleasent.  We'll 1000% be renting another van from them again.", "pics": null, "resp": {"time": 1621289265699, "text": "Thanks! Glad you had a great adventure with our van."}, "gmap_id": "0x8752f6a5524b4211:0x3e36cd92537e106c", "relevant": "Yes"}
{"user_id": "100899581910737442283", "name": "barry craig", "time": 1536976362977, "rating": 5, "text": "Great experience thank you for answering all my questions since I'm new to this vacationing thing. Will be using in a heartbeat for astronomy outings. The Ford Transit medium 5 size plenty of room for gear and getting change. Queen size bed very comfortable. The electric refrigerator a godsend. Good luck I'll post some nice images from the parks visited. 1360 miles 6 days.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipPhKAVLQ4JidA2h7WnmlUFeJCyA7l5QqZt8ArxZ=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipM4T_DaSgUvbjpJCVFkUDGxf5dUdxIniDYiy8ll=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOFdT-A8u1e4ybrWjF1GxSZ4DmqeQXG4nB4sxtn=w150-h150-k-no-p"]}], "resp": {"time": 1536976844572, "text": "Thanks for the review Barry!  It was a pleasure working with you. I am happy I could answer your questions to help you have a great trip. I look forward to helping you on another trip!"}, "gmap_id": "0x8752f6a5524b4211:0x3e36cd92537e106c", "relevant": "Yes"}
{"user_id": "102966189077807774683", "name": "Dillon Cassidy", "time": 1618263434825, "rating": 5, "text": "Wandervan made out trip so easy. Everything was laid out concisely and made out pick up and drop off so simple. The van was awesome and made our trip exponentially better.", "pics": null, "resp": null, "gmap_id": "0x8752f6a5524b4211:0x3e36cd92537e106c", "relevant": "Yes"}
{"user_id": "101679110521667714580", "name": "Jennifer Singleton", "time": 1617386240758, "rating": 5, "text": "We had a fabulous trip. The camper van was a great \"home\" for the week. The staff was only a text away to answer any questions we had. I am looking forward to my next booking.", "pics": null, "resp": null, "gmap_id": "0x8752f6a5524b4211:0x3e36cd92537e106c", "relevant": "Yes"}
{"user_id": "110622980045229288684", "name": "Scott Feighner", "time": 1617837159850, "rating": 5, "text": "Had an amazing week long trip in the deserts of Southern Utah.  Van was so well laid out and the team at Wander Van we super prompt in my requests to make sure that the van would be car seat/pack n play  compatible for my 1 and 3 year olds. Van was super new and easy to drive and park at our campsites. My 1 year old missed zero naps cuz the van was so comfortable and quiet too. Looking forward to my next adventure", "pics": null, "resp": null, "gmap_id": "0x8752f6a5524b4211:0x3e36cd92537e106c", "relevant": "Yes"}
{"user_id": "113372040182712140514", "name": "Chris Grimes", "time": 1603938016429, "rating": 5, "text": "Amazing experience.  Very flawless from booking, answer questions to turning in the van was incredibly easy.  The van itself was very well organized and planned.  The large easily held my family of four.\n\nCannot say enough good things about Wandervans.  Stop looking around....Just book with them and be done with it!", "pics": null, "resp": {"time": 1603978984956, "text": "Thanks Chris! We're so glad you had a great trip. Let us know if you're ever looking to rent again. Cheers!"}, "gmap_id": "0x8752f6a5524b4211:0x3e36cd92537e106c", "relevant": "Yes"}
{"user_id": "100977188866165721384", "name": "John Kinneary", "time": 1621470151772, "rating": 5, "text": "Absolutely can recommend WanderVans!  Four of us just completed a week’s tour of the Big 5 in Utah. The large size WanderVan was perfect. Great amenities, comfortable beds, roomy, and an easy rider on the roads!  Customer service was the best, bar none!  Looking forward to our next vacation in a WanderVan!", "pics": null, "resp": null, "gmap_id": "0x8752f6a5524b4211:0x3e36cd92537e106c", "relevant": "Yes"}
{"user_id": "105019470645297220589", "name": "Rx H", "time": 1558806745883, "rating": 5, "text": "Excellent trip with Wandervans. The van was clean, great to drive and had everything we needed for a five day trip across Utah. The price was great for the small van, compared to the other vans available. We would def use this van again if we visit in the future.", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMl-lBUFWKVW-oVxtITQZXB_fchFsjFUY77js8x=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipP05IqWlLDUb3Qysnj7RmPZzvAX_3GtkLythP3o=w150-h150-k-no-p"]}], "resp": {"time": 1558807551596, "text": "Thank you so much for the review Rx. We are so glad we were able to assist you so well in your adventure. We look forward to working with you again."}, "gmap_id": "0x8752f6a5524b4211:0x3e36cd92537e106c", "relevant": "Yes"}
{"user_id": "106998358916292868725", "name": "Lara Aho", "time": 1603926586624, "rating": 5, "text": "Wandervans is exactly as they advertise on their website. It was a seamless check-out/ check-in process. For the few questions we had during the rental process, it was always easy to call and talk to a real person from Wandervans right away. Plus they answer email queries immediately. Super friendly, laid-back staff. The experience of \"doing\" a Wandervan was awesome, just what we wanted for exploring, camping and having your own kitchen /fridge with you. Excellent. Can't wait to rent again from Wandervans.", "pics": null, "resp": {"time": 1603928110419, "text": "Thanks Lara! Give us shout next time you're looking to rent! We have locations in Boise and now Portland for an endless option of adventures."}, "gmap_id": "0x8752f6a5524b4211:0x3e36cd92537e106c", "relevant": "Yes"}
{"user_id": "117675538974336790563", "name": "Erica Allaby", "time": 1603995395473, "rating": 5, "text": "Wandervans was an absolutely amazing way to travel. The team had everything all set upon arrival and the van gave us all we needed and more to explore the great outdoors. Definitely plan to book again in the future with this cool company.", "pics": null, "resp": {"time": 1607401850050, "text": "Thanks again and we look forward to seeing you again in the future!"}, "gmap_id": "0x8752f6a5524b4211:0x3e36cd92537e106c", "relevant": "Yes"}
{"user_id": "102612936698895807667", "name": "Josh Weiner", "time": 1604120863426, "rating": 5, "text": "We had a wonderful experience renting a medium van earlier this year exploring southern Utah and western Colorado. The Wandervans team was easy to work with, and the van was clean and user-friendly. Van life is a true pleasure, and we are grateful to Wandervans for introducing us to it.", "pics": null, "resp": {"time": 1607401823554, "text": "We are glad we could introduce you to vanlife! Thanks again!"}, "gmap_id": "0x8752f6a5524b4211:0x3e36cd92537e106c", "relevant": "Yes"}
{"user_id": "113944175361137088293", "name": "steven Law", "time": 1541620514429, "rating": 5, "text": "My wife and I took our three-year-old daughter on a roadtrip in late October using a Wandervan. It was spectacular! It was easily one of our favorite family vacations and a lot of that was due to the comfort and convenience the Wandervan gave us.\nThe van was so spacious and comfortable. We toured from Salt Lake City to Page, Arizona and stopped along the way at Moab, Arches National Park, Deadhorse Point State Park and on to Monument Valley. When our daughter got tired we returned to our Wandervan and put her down for a nap in the back of the van.\nIt was chilly outside at night, but we just turned on our heater and the van was soon comfy- cozy. We slept great all night long.\nOur Wandervan was the perfect, moveable basecamp. I HIGHLY recommend them!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMb-GvB-cTIIONMyHYcHvv7l83fDmuxGpEtA0nd=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMpR3yqKkSyU5KEkf3qSrpM7NCmsFXRYX5eh7Ai=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPt-dRC2XalO2KARN8rO3VhaAUQd7hpRI1h44nA=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPAVZZXJVuDoF_eY2ehtTS7cELv67UHO_ZIBCkw=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipOS-_DTvrzz5NeMkXq_7Co1IhhiQ5GyBitIsqdi=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipPLetVnN1XETP2DTUG_DndnzJuO-5li83twZN9V=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipMtdoJF7fj5r_f3dD5j3pjFvu-77RU8DkE6QN7r=w150-h150-k-no-p"]}, {"url": ["https://lh5.googleusercontent.com/p/AF1QipNoRi84P24M6hJc8KWjqAXx3L3YGh8ruds6m7A9=w150-h150-k-no-p"]}], "resp": {"time": 1541712281334, "text": "Thanks for the review Steven! I am so glad you think our vans are so spacious. We think they are just the right size too!"}, "gmap_id": "0x8752f6a5524b4211:0x3e36cd92537e106c", "relevant": "Yes"}
{"user_id": "101737472684138304291", "name": "Mike Gemmell", "time": 1603908577109, "rating": 5, "text": "Daryl  and wandervans were awesome to work with. Especially given the challenges of the pandemic. The van was clean, Daryl was responsive to all my questions. My pup loved the van too. I'd definitely recommend them if you're looking for a van in Utah!", "pics": [{"url": ["https://lh5.googleusercontent.com/p/AF1QipMAleHMDm7Bz-ruwOgKGLZNfN4EpTDq1doKbJSV=w150-h150-k-no-p"]}], "resp": {"time": 1603922445740, "text": "Thanks Mike! Glad you had a fantastic experience."}, "gmap_id": "0x8752f6a5524b4211:0x3e36cd92537e106c", "relevant": "Yes"}
{"user_id": "106022591699618792980", "name": "Kevin Shilling", "time": 1603993977748, "rating": 5, "text": "I appreciated the easy pick up and videos available describing how to set up the van.  No hidden charges and everything was as advertised.  It's a big rig but it handles well.", "pics": null, "resp": {"time": 1603994866236, "text": "Thanks Kevin! The Large van is on the longer size, but definitely cruises really well. Glad you and your family had a fantastic trip."}, "gmap_id": "0x8752f6a5524b4211:0x3e36cd92537e106c"}
{"user_id": "107646390224044477660", "name": "Wenda Ye", "time": 1607814935400, "rating": 5, "text": "Friendly and helpful staff. We were able to check in and out smoothly and customer service was very easy to reach.", "pics": null, "resp": null, "gmap_id": "0x8752f6a5524b4211:0x3e36cd92537e106c", "relevant": "Yes"}
